[
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-INFO-IT&courseId=B1C-PROG-IT",
        "module": "Informatique de base",
        "course": "Programmierung",
        "grade": 5.1,
        "periods": 96,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait",
            "list": [
                "Décrire les étapes du développement d'un programme informatique, les outils et fichiers impliqués",
                "Utiliser un environnement de développement et un debugger pour l'écriture, l'exécution et le test d'un programme Java",
                "Expliquer la notion de type et faire la distinction entre un type primitif et un type référence",
                "Déclarer et initialiser des variables",
                "Utiliser les opérateurs artithmétiques, logiques et relationnels pour former des expressions",
                "Ecrire des instructions conditionnelles (branchement et sélection)",
                "Utiliser les instructions itératives dans des algorithmes simples",
                "Déclarer, créer et utiliser des tableaux",
                "Déclarer et invoquer des méthodes",
                "Générer, traiter et propager des exceptions là où c'est nécessaire",
                "Ecrire un programme qui lit/écrit des fichiers texte",
                "Ecrire une classe, créer des instances (objets) et les utiliser",
                "Expliquer et utiliser correctement les champs et méthodes statiques",
                "Expliquer et exploiter la notion d'héritage",
                "Travailler avec des classes abstraites et des interfaces",
                "Utiliser la généricité",
                "Choisir le moyen de définir des classes (internes, anonymes...)",
                "Utiliser les expressions lambda, et traiter des streams Java 8"
            ]
        },
        "contents": [
            {
                "intro": "Introduction à la programmation",
                "list": [
                    "Notion d'ordinateur (architecture, composants principaux) et programme",
                    "Développement : étapes, outils utilisés, fichiers impliqués, environnement de travail",
                    "Maîtrise des fonctions de base d'un environnement de développement (édition, compilation, debugging)",
                    "Notions de type et de variable; distinction entre type primitif et type référence",
                    "Notions d'instruction et de programme"
                ]
            },
            {
                "intro": "Programmation en Java",
                "list": [
                    "Bases du langage, identificateurs, mots-réservés, variables, types primitifs, expressions et affectations",
                    "Structures de contrôle : séquence, sélection (instructions if..else et switch)",
                    "Instructions itératives (boucles while, do..while et for)",
                    "Méthodes et fonctions (spécification, implémentation, utilisation); passage de paramètres",
                    "Tableaux uni- et multi-dimensionnels",
                    "Création et manipulation des chaînes de caractères (String)",
                    "Génération, traitement et propagation des exceptions",
                    "Entrées/Sorties (I/O) simples, notions de flux, lecture et écriture de fichiers texte",
                    "Classes et objets",
                    "Packages et contrôle d'accès",
                    "Membres statiques (champs et méthodes)",
                    "Notion d'héritage et création de sous-classes",
                    "Classes abstraites et interfaces",
                    "Classes internes, anonymes",
                    "Expressions lambdas",
                    "Généricité",
                    "Stream (flow-based programming)"
                ]
            }
        ],
        "credits": 6.5,
        "year": 1,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, év. tests courts non annoncés"
        ],
        "teachers": [
            "Jacques Supcik"
        ],
        "id": 1,
        "moduleEn": "Basic computing Science",
        "courseEn": "Programming",
        "contentsEn": [
            {
                "list": [
                    "Concept of computer (architecture, main components) and program",
                    "Development: steps, tools used, files involved, work environment",
                    "Mastering the basic functions of a development environment (editing, compiling, debugging)",
                    "Concepts of type and variable; distinction between primitive type and reference type",
                    "Instructional and Program Concepts"
                ],
                "intro": "Introduction to Programming"
            },
            {
                "list": [
                    "Language basics, identifiers, reserved words, variables, primitive types, expressions and assignments",
                    "Control structures: sequence, selection (if..else and switch instructions)",
                    "Instructions itératives (boucles while, do..while et for)",
                    "Methods and functions (specification, implementation, use); parameter passing",
                    "One- and multi-dimensional tables",
                    "Creating and manipulating strings (String)",
                    "Exception generation, handling and propagation",
                    "Simple inputs/outputs (I/O), flow concepts, reading and writing text files",
                    "Classes and objects",
                    "Packages and access control",
                    "Static members (fields and methods)",
                    "Concept of inheritance and creation of subclasses",
                    "Abstract classes and interfaces",
                    "Classes internes, anonymes",
                    "Expressions lambdas",
                    "General",
                    "Stream (flow-based programming)"
                ],
                "intro": "Programming in Java"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, possibly unannounced short tests."
        ],
        "objectivesEn": {
            "list": [
                "Describe the steps in the development of a computer program, the tools and files involved",
                "Using a development environment and a debugger to write, run and test a Java program",
                "Explain the concept of type and distinguish between a primitive type and a reference type.",
                "Declaring and initializing variables",
                "Use artithmetic, logical and relational operators to form expressions",
                "Write conditional instructions (connection and selection)",
                "Using iterative instructions in simple algorithms",
                "Declare, create and use tables",
                "Declare and invoke methods",
                "Generate, process and propagate exceptions where necessary",
                "Writing a program that reads/writes text files",
                "Writing a class, creating instances (objects) and using them",
                "Explain and correctly use static fields and methods",
                "Explain and exploit the notion of inheritance",
                "Working with abstract classes and interfaces",
                "Use genericity",
                "Choose the way to define classes (internal, anonymous...)",
                "Using lambda expressions, and processing Java 8 streams"
            ],
            "intro": "At the end of the course, the student knows"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-INFO-IT&courseId=B1C-ALGO-IT",
        "module": "Informatique de base",
        "course": "Algorithmique et structures de données 1",
        "grade": 5.3,
        "periods": 96,
        "objectives": {
            "intro": "Ce module établit des bases solides de programmation. A la fin du module, l'étudiant sait:",
            "list": [
                "Analyser un problème informatique, et concevoir un algorithme pour le résoudre.",
                "Ecrire et utiliser des structures de données complexes, et des algorithmes non triviaux.",
                "Analyser la complexité théorique d'un programme et la vérifier expérimentalement.",
                "Réfléchir de façon abstraite, en distinguant spécification et implémentation, et en s'aidant de formalismes adéquats (esquisses, pseudo-code, ...).",
                "Utiliser un environnement de développement logiciel, et un langage de programmation impérative orienté-objet."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Notion d'algorithme et analyse de complexité.",
                    "Notion de type abstrait, études de cas (pile, file, liste chaînée, ensemble, table de hachage, bitset, file de priorité, introduction aux arbres et graphes).",
                    "Techniques de programmation (récursivité, chaînage, programmation dynamique, traitement d'erreurs, généricité, algorithmes probabilistes, exemple de backtracking).",
                    "Quelques algorithmes classiques (tris, recherche binaire, nombres aléatoires, hachage, cryptographie RSA...).",
                    "Démarche de résolution de problème, spécification de programme par PRE/POST-conditions, tests de programme, lutte systématique contre les bugs, problèmes numériques en programmation, mesure du temps d'exécution"
                ]
            }
        ],
        "credits": 6.5,
        "year": 1,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports",
            "Examen: écrit (120 min.)"
        ],
        "teachers": [
            "Andreas Fischer"
        ],
        "id": 2,
        "moduleEn": "Basic computing Science",
        "courseEn": "Algorithmics and Data Structures",
        "contentsEn": [
            {
                "list": [
                    "Notion of algorithm and complexity analysis.",
                    "Notion of abstract type, case studies (stack, queue, chained list, set, hash table, bitset, priority queue, introduction to trees and graphs).",
                    "Programming techniques (recursivity, chaining, dynamic programming, error processing, genericity, probabilistic algorithms, example of backtracking).",
                    "Some classical algorithms (sorting, binary search, random numbers, hash, RSA cryptography...).",
                    "Problem-solving approach, program specification by PRE/POST-conditions, program testing, systematic fight against bugs, numerical problems in programming, measurement of execution time"
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports",
            "Exam: written (120 min.)"
        ],
        "objectivesEn": {
            "list": [
                "Analyze a computer problem, and design an algorithm to solve it.",
                "Write and use complex data structures and non-trivial algorithms.",
                "Analyze the theoretical complexity of a program and verify it experimentally.",
                "Think in an abstract way, distinguishing between specification and implementation, and using adequate formalisms (sketches, pseudo-code, ...).",
                "Use a software development environment, and an object-oriented imperative programming language."
            ],
            "intro": "This module provides a solid foundation for programming. At the end of the module, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-INFO-IT&courseId=B1C-INHM-IT",
        "module": "Informatique de base",
        "course": "Interface Homme-Machine 1",
        "grade": 5,
        "periods": 48,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant est capable de :",
            "list": [
                "Exploiter les notions techniques vues au cours de programmation et nécessaires à la création et à la gestion des interfaces utilisateur en Java (interfaces, classes internes, énumérations, généricité, annotations, expressions lambda, etc.).",
                "Créer une interface-utilisateur classique avec JavaFX en mode procédural et en mode déclaratif (FXML).",
                "Créer et structurer un graphe de scène en choisissant les conteneurs et composants adaptés à la conception souhaitée.",
                "Gérer la disposition des éléments de l'interface en exploitant et paramétrant judicieusement les conteneurs (layout-panes) et leurs contraintes de disposition.",
                "Gérer les événements associés au dialogue homme-machine.",
                "Structurer les classes d'une application en respectant les principes de l'architecture MVC (Model-View-Controller).",
                "Définir la notion d'utilisabilité et décrire les principales méthodes d'évaluations ergonomiques.",
                "Décrire et classer les principaux critères ergonomiques qui influencent la qualité de l'interaction.",
                "Prendre en compte certaines caractéristiques de l'humain face à un système interactif (aspects perceptifs, cognitifs, moteurs et comportementaux).",
                "Concevoir une interface-utilisateur qui respecte les règles liées aux aspects visuels (icônes, mises en évidence, agencement, couleurs, typographie, etc.).",
                "Écrire une interface utilisateur qui s'adapte au contexte de l'utilisateur (résolution de l'écran, type et configuration de la machine cible).",
                "Consulter et exploiter la documentation (API) relative aux librairies utilisées pour créer et gérer l'interface utilisateur.",
                "Déployer une application sous forme de fichier JAR exécutable comprenant l'ensemble des ressources nécessaires."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Mise en pratique des éléments vus au cours de programmation : classes, classes abstraites, interfaces, classes internes, enum, généricité, annotations, expressions lambda, références de méthodes, etc.",
                    "Aspects techniques liés à l'utilisation de JavaFX (Stage, graphes de scène, conteneurs, composants UI, propriétés, binding, gestion des événements, ...). Principes de la programmation événementielle.",
                    "Utilisation de l'outil SceneBuilder pour générer des interfaces graphiques en mode déclaratif (format XML / FXML).",
                    "Découpage d'une application selon l'architecture Model-View-Controller (MVC).",
                    "Menus déroulants et contextuels. Création de raccourcis clavier.",
                    "Création et utilisation de boîtes de dialogues générales et spécialisées.",
                    "Déploiement d'une application comportant des ressources externes (images, son, ...).",
                    "Principes généraux liés à l'interaction homme-machine, à l'utilisabilité, aux critères ergonomiques et aux facteurs humains.",
                    "Évaluations ergonomiques : techniques et mise en oeuvre.",
                    "Éléments liés à la visualisation (icônes, techniques de mise en évidence, disposition et alignement, gabarit d'écran, parcours du regard, agencement, utilisation des couleurs, définitions et règles typographiques, ...)."
                ]
            }
        ],
        "credits": 4,
        "year": 1,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, év. tests courts non annoncés"
        ],
        "teachers": [
            "Sandy Ingram"
        ],
        "id": 3,
        "moduleEn": "Basic computing Science",
        "courseEn": "Human-Computer Interaction",
        "contentsEn": [
            {
                "list": [
                    "Putting into practice the elements seen during programming: classes, abstract classes, interfaces, internal classes, enum, genericity, annotations, lambda expressions, method references, etc.",
                    "Technical aspects related to the use of JavaFX (Stage, scene graphs, containers, UI components, properties, binding, event management, ...). Principles of event-driven programming.",
                    "Using the SceneBuilder tool to generate graphical interfaces in declarative mode (XML / FXML format).",
                    "Splitting of an application according to the Model-View-Controller (MVC) architecture.",
                    "Drop-down and context-sensitive menus. Creation of keyboard shortcuts.",
                    "Creation and use of general and specialized dialog boxes.",
                    "Deployment of an application with external resources (images, sound, ...).",
                    "General principles related to human-machine interaction, usability, ergonomic criteria and human factors.",
                    "Ergonomic assessments: techniques and implementation.",
                    "Elements related to visualization (icons, highlighting techniques, layout and alignment, screen template, gaze path, layout, use of colors, definitions and typographical rules, ...)."
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, possibly unannounced short tests."
        ],
        "objectivesEn": {
            "list": [
                "Exploit the technical notions seen during programming and necessary for the creation and management of user interfaces in Java (interfaces, internal classes, enumerations, genericity, annotations, lambda expressions, etc.).",
                "Create a classic user interface with JavaFX in procedural and declarative mode (FXML).",
                "Create and structure a scene graph by choosing the right containers and components for the desired design.",
                "Manage the layout of the interface elements by exploiting and judiciously parameterizing the containers (layout-panes) and their layout constraints.",
                "Manage events associated with the man-machine dialogue.",
                "Structure the classes of an application by respecting the principles of the MVC (Model-View-Controller) architecture.",
                "Define the concept of usability and describe the main methods of ergonomic assessments.",
                "Describe and rank the main ergonomic criteria that influence the quality of interaction.",
                "To take into account certain characteristics of humans facing an interactive system (perceptual, cognitive, motor and behavioural aspects).",
                "Design a user interface that respects the rules related to visual aspects (icons, highlighting, layout, colors, typography, etc.).",
                "Write a user interface that adapts to the user's context (screen resolution, type and configuration of the target machine).",
                "Consult and use the documentation (API) relating to the libraries used to create and manage the user interface.",
                "Deploy an application in the form of an executable JAR file including all the necessary resources."
            ],
            "intro": "At the end of the course, the student is able to :"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-LACG-IT&courseId=B1C-TED1-CEGIMT",
        "module": "Langues, communication et gestion",
        "course": "Allemand technique 1",
        "grade": "Validated",
        "periods": 32,
        "objectives": {
            "intro": "Das Modul ''Technisches Deutsch'' richtet sich an nichtdeutschsprachige Studierende in den zweisprachigen Klassen, welche noch nicht auf einem Niveau B2 in den vier Sprachkompetenzen sind.",
            "list": []
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Grundlagen wissenschaftlichen Schreibens",
                    "Satzbausteine für Berichte",
                    "Produktpräsentation",
                    "Schreibtandem (E-Mail)"
                ]
            }
        ],
        "credits": 1.5,
        "year": 1,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, présentations"
        ],
        "teachers": [
            "Mario Luongo"
        ],
        "id": 4,
        "moduleEn": "Languages, communication and management",
        "courseEn": "Technical German 1",
        "contentsEn": [
            {
                "list": [
                    "Foundations of scientific writing",
                    "Record modules for reports",
                    "Product presentation",
                    "Writing tandem (E-Mail)"
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, presentations"
        ],
        "objectivesEn": {
            "list": [],
            "intro": "The module ''Technical German'' is aimed at non-German-speaking students in the bilingual classes who are not yet at level B2 in the four language skills."
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-LACG-IT&courseId=B1C-ENG1-CEGIMT",
        "module": "Langues, communication et gestion",
        "course": "Anglais 1",
        "grade": 5.9,
        "periods": 32,
        "objectives": {
            "intro": "To master the four skills of listening, speaking, reading and writing at (pre)intermediate level, or even advanced, according to the learners' admission levels and grouping (streaming/tracking).At the end of the module students should be able to:",
            "list": [
                "communicate effectively on general topics, both orally and written;",
                "demonstrate a working knowledge of English in a wide range of situations and topic areas."
            ]
        },
        "contents": [
            {
                "intro": "Emphasis is placed on all four language skill development areas, with a balance of language structure (grammar) and practical usage. More precisely:",
                "list": [
                    "Emphasis is placed on all four language skill development areas, with a balance of language structure (grammar) and practical usage. More precisely:",
                    "enlarging and acquiring everyday vocabulary (Threshold level) as well as idiomatic expressions and colloquialisms;",
                    "practising oral skills (listening and speaking) through systematic training and meaningful activities (such as tape listening, conversations, role playing, presentations, etc.)",
                    "practising written skills for the industrial world (reading general and scientific/vocational texts, writing compositions, letters...)",
                    "general approach to lifestyles and cultures of the English-speaking world."
                ]
            },
            {
                "intro": "Focus is on authentic material (wide range of accents, unrestricted vocabulary and natural speech, etc.) and teamwork.",
                "list": []
            }
        ],
        "credits": 1.5,
        "year": 1,
        "semester": "Automne",
        "language": "Anglais",
        "evaluations": [
            "Contrôle continu: travaux écrits, présentations, le choix de la langue à suivre et le niveau du cours (ou l'éventuelle dispense) sont clarifiés la première semaine de cours selon les indications des enseignant-e-s concerné-e-s"
        ],
        "teachers": [
            "Santiago Cruz"
        ],
        "id": 5,
        "moduleEn": "Languages, communication and management",
        "courseEn": "English 1",
        "contentsEn": [
            {
                "list": [
                    "Emphasis is placed on all four language skill development areas, with a balance of language structure (grammar) and practical usage. More precisely:",
                    "enlarging and acquiring everyday vocabulary (Threshold level) as well as idiomatic expressions and colloquialisms;",
                    "practising oral skills (listening and speaking) through systematic training and meaningful activities (such as tape listening, conversations, role playing, presentations, etc.)",
                    "practising written skills for the industrial world (reading general and scientific/vocational texts, writing compositions, letters...)",
                    "general approach to lifestyles and cultures of the English-speaking world."
                ],
                "intro": "Emphasis is placed on all four language skill development areas, with a balance of language structure (grammar) and practical usage. More precisely:"
            },
            {
                "list": [],
                "intro": "Focus is on authentic material (wide range of accents, unrestricted vocabulary and natural speech, etc.) and teamwork."
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "English",
        "evaluationsEn": [
            "Continuous assessment: written work, presentations, the choice of language to be followed and the level of the course (or possible exemption) are clarified during the first week of the course according to the indications of the teachers concerned."
        ],
        "objectivesEn": {
            "list": [
                "communicate effectively on general topics, both orally and written;",
                "demonstrate a working knowledge of English in a wide range of situations and topic areas."
            ],
            "intro": "To master the four skills of listening, speaking, reading and writing at (pre)intermediate level, or even advanced, according to the learners' admission levels and grouping (streaming/tracking).At the end of the module students should be able to:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-LACG-IT&courseId=B1C-COM1-CEGIMT",
        "module": "Langues, communication et gestion",
        "course": "Communication 1",
        "grade": 5.1,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours l'étudiant sait",
            "list": [
                "Comprendre la place et les buts de la communication professionnelle",
                "Améliorer son aptitude à communiquer et à convaincre",
                "Mettre en pratique les règles de communication en rapport avec le langage non verbal et le rapport avec l'autre",
                "Réaliser et tirer profit des aides visuelles",
                "Modifier un document écrit pour en réaliser une présentation orale",
                "Utiliser et rédiger différents types de plan en fonction de l'information à transmettre",
                "Utiliser différents types d'introduction et de conclusion en fonction de l'information à transmettre."
            ]
        },
        "contents": [
            {
                "intro": "Prendre la parole en public",
                "list": [
                    "Définition de la communication",
                    "L'impact en communication et l'importance de la communication non verbale",
                    "Le public cible : pour qui parlons-nous?",
                    "Définir les objectifs de la communication",
                    "Gérer le temps de parole",
                    "L'ambiguïté de la communication, les freins et les parasites",
                    "Avantages et inconvénients des aides visuelles",
                    "Concevoir et utiliser les aides visuelles",
                    "La langage du corps et son importance dans la communication orale"
                ]
            }
        ],
        "credits": 1.5,
        "year": 1,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, présentations"
        ],
        "teachers": [
            "Bruno Müller"
        ],
        "id": 6,
        "moduleEn": "Languages, communication and management",
        "courseEn": "Communcation 1",
        "contentsEn": [
            {
                "list": [
                    "Definition of communication",
                    "Communication impact and the importance of non-verbal communication",
                    "The target audience: Who are we talking about?",
                    "Define the objectives of the communication",
                    "Manage speaking time",
                    "Communication ambiguity, brakes and interference",
                    "Advantages and disadvantages of visual aids",
                    "Designing and using visual aids",
                    "Body language and its importance in oral communication"
                ],
                "intro": "Public Speaking"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Understand the place and goals of professional communication",
                "Improve communication and persuasion skills",
                "Putting into practice the rules of communication in relation to non-verbal language and the relationship with others",
                "Making and taking advantage of visual aids",
                "Modifying a written document to make an oral presentation",
                "Use and write different types of plans depending on the information to be conveyed",
                "Use different types of introductions and conclusions depending on the information to be conveyed."
            ],
            "intro": "At the end of the course the student knows"
        }
    },
    {
        "module": "Langues, communication et gestion",
        "course": "Methodologie",
        "grade": 4.2,
        "periods": 32,
        "objectives": {
            "intro": "Partie sécurité IT:",
            "list": [
                "Sait utiliser des outils organisationnels comme : Mind-map, Pareto, matrice de risque, tableau multicritères, Swot, diagramme de causes à effet DCE, PV",
                "Sait décrire un projet sous forme d'objectifs, de tâches, de planning",
                "Connait des principes telsque: Eisenhower, les styles d'apprentissage, Tuckman"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Pareto",
                    "Principe d'Eisenhower",
                    "Swot",
                    "Styles d'apprentissage",
                    "Résolution de problèmes",
                    "diagramme de causes à effet DCE",
                    "Moteurs et Freins",
                    "Brainstorming",
                    "Grille morphologique",
                    "Tableau multicritères de décision",
                    "Tuckman"
                ]
            }
        ],
        "credits": 2,
        "year": 1,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Stéphane Rolle",
            "Marc Wohlhauser"
        ],
        "id": 7,
        "moduleEn": "Languages, communication and management",
        "courseEn": "Methodology",
        "contentsEn": [
            {
                "list": [
                    "Wall",
                    "Prince of Eisenhower",
                    "Swot",
                    "Learning Styles",
                    "Problem solving",
                    "WFD cause and effect diagram",
                    "Motors and Brakes",
                    "Brainstorming",
                    "Morphological grid",
                    "Multi-criteria decision table",
                    "Tuckman"
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Can use organizational tools such as: Mind-map, Pareto, risk matrix, multi-criteria table, Swot, DCE causal diagram, PV",
                "Can describe a project in the form of objectives, tasks, planning, etc.",
                "Knows principles such as: Eisenhower, learning styles, Tuckman..."
            ],
            "intro": "IT security part:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-LACG-IT&courseId=B1C-PTIC-IT",
        "module": "Langues, communication et gestion",
        "course": "Projet TIC",
        "grade": "Validated",
        "periods": 24,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant:",
            "list": [
                "aura exercé la recherche et l'imagination de solutions innovantes et créatives",
                "aura exercé la recherche et la collecte d'informations utiles à la résolution de problèmes de nature diverse, à juger de leur utilité et à en faire la synthèse",
                "aura appris à résoudre des problèmes de manière autonome et à collaborer au sein d'un groupe",
                "saura communiquer avec le superviseur sur l'avancement du travail et les résultats finaux"
            ]
        },
        "contents": [
            {
                "intro": "Projets en groupe dans les domaines de la robotique et de la sécurité informatique et des réseaux",
                "list": []
            }
        ],
        "credits": 2,
        "year": 1,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: TP/évaluation de rapports, qualité des résultats du projet, exposés, participation active au sein du groupe"
        ],
        "teachers": [
            "François Buntschu",
            "François Kilchoer",
            "Jean-Roland Schuler"
        ],
        "id": 8,
        "moduleEn": "Languages, communication and management",
        "courseEn": "IT Project",
        "contentsEn": [
            {
                "list": [],
                "intro": "Group projects in the fields of robotics and computer and network security"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Ongoing monitoring: TP/evaluation of reports, quality of project results, presentations, active participation in the group."
        ],
        "objectivesEn": {
            "list": [
                "will have researched and imagined innovative and creative solutions",
                "will have researched and collected information useful for solving problems of various kinds, judging their usefulness and synthesizing them",
                "will have learned to solve problems independently and to collaborate within a group",
                "Communicate with the supervisor on the progress of the work and the final results."
            ],
            "intro": "At the end of the course, the student:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-LACG-IT&courseId=B1C-TED2-CEGIMT",
        "module": "Langues, communication et gestion",
        "course": "Allemand technique 2",
        "grade": "Validated",
        "periods": 32,
        "objectives": {
            "intro": "Das Modul Technisches Deutsch 2 baut auf dem Modul Technisches Deutsch 1 auf",
            "list": []
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Abbildungen und Tabellen beschreiben",
                    "Technischer Vortrag",
                    "Vorstellungsgespräch",
                    "Sprachtandem"
                ]
            }
        ],
        "credits": 1.5,
        "year": 1,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, présentations"
        ],
        "teachers": [
            "Mario Luongo"
        ],
        "id": 9,
        "moduleEn": "Languages, communication and management",
        "courseEn": "Technical German 2",
        "contentsEn": [
            {
                "list": [
                    "Describe figures and tables",
                    "Technical lecture",
                    "Job interview",
                    "Language tandem"
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, presentations"
        ],
        "objectivesEn": {
            "list": [],
            "intro": "The module Technical German 2 builds on the module Technical German 1"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-LACG-IT&courseId=B1C-ENG2-CEGIMT",
        "module": "Langues, communication et gestion",
        "course": "Anglais 2",
        "grade": 5.3,
        "periods": 32,
        "objectives": {
            "intro": "Basically, same objectives as stated for module 1, but more specifically, at the end of module 2, students should be able to",
            "list": [
                "read general and specialised (vocationally oriented) texts",
                "give formal presentations and hold discussions in front of an audience",
                "use the specific vocabulary and relevant information for studying abroad (project, diploma work, Master, etc.), not only in English-speaking countries, but also in any Swiss or foreign academic place where English is required for the application procedure and studies"
            ]
        },
        "contents": [
            {
                "intro": "Continuation and development of all activities defined in Module 1, but in addition",
                "list": [
                    "business English knowledge, such as writing appropriate application (cover) letters and CVs (résumés), according not only to normal writing practice in the USA and UK, but also to Swiss and international regulations (both academic and corporate)"
                ]
            }
        ],
        "credits": 1.5,
        "year": 1,
        "semester": "Printemps",
        "language": "Anglais",
        "evaluations": [
            "Contrôle continu: travaux écrits, présentations, le choix de la langue à suivre et le niveau du cours (ou l'éventuelle dispense) sont clarifiés la première semaine de cours selon les indications des enseignant-e-s concerné-e-s"
        ],
        "teachers": [
            "Santiago Cruz"
        ],
        "id": 10,
        "moduleEn": "Languages, communication and management",
        "courseEn": "English 2",
        "contentsEn": [
            {
                "list": [
                    "business English knowledge, such as writing appropriate application (cover) letters and CVs (résumés), according not only to normal writing practice in the USA and UK, but also to Swiss and international regulations (both academic and corporate)"
                ],
                "intro": "Continuation and development of all activities defined in Module 1, but in addition"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "English",
        "evaluationsEn": [
            "Continuous assessment: written work, presentations, the choice of language to be followed and the level of the course (or possible exemption) are clarified during the first week of the course according to the indications of the teachers concerned."
        ],
        "objectivesEn": {
            "list": [
                "read general and specialised (vocationally oriented) texts",
                "give formal presentations and hold discussions in front of an audience",
                "use the specific vocabulary and relevant information for studying abroad (project, diploma work, Master, etc.), not only in English-speaking countries, but also in any Swiss or foreign academic place where English is required for the application procedure and studies"
            ],
            "intro": "Basically, same objectives as stated for module 1, but more specifically, at the end of module 2, students should be able to"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-LACG-IT&courseId=B1C-COM2-CEGIMT",
        "module": "Langues, communication et gestion",
        "course": "Communication 2",
        "grade": 5.3,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours l'étudiant sait",
            "list": [
                "Présenter un document écrit selon les règles en usage dans l'édition",
                "Utiliser différents types de plan en fonction de l'information à transmettre",
                "Appliquer différentes règles de bonne gestion d'un groupe de travail",
                "Prendre conscience de l'attitude à adopter lors d'un entretien d'embauche",
                "Rédiger les documents accompagnant une demande d'emploi",
                "Connaît les différents types de canaux d'information dans l'entreprise avec leurs avantages et inconvénients",
                "Connaître et comprendre les principes d'une démarche publicitaire"
            ]
        },
        "contents": [
            {
                "intro": "Prendre la parole en public",
                "list": [
                    "Mettre de l'ordre dans ses idées",
                    "La présentation écrite d'un document",
                    "Le travail de groupe",
                    "La lettre de motivation et l'entretien d'embauche",
                    "Les canaux d'information de l'entreprise",
                    "La stratégie publicitaire"
                ]
            }
        ],
        "credits": 1.5,
        "year": 1,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, présentations"
        ],
        "teachers": [
            "Bruno Müller"
        ],
        "id": 11,
        "moduleEn": "Languages, communication and management",
        "courseEn": "Communication 2",
        "contentsEn": [
            {
                "list": [
                    "Putting your thoughts in order",
                    "The written presentation of a document",
                    "Group work",
                    "The cover letter and the job interview",
                    "The company's information channels",
                    "Advertising strategy"
                ],
                "intro": "Public Speaking"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Submit a document written according to the rules of publishing.",
                "Use different types of plans depending on the information to be conveyed",
                "Apply different rules of good management of a workgroup",
                "Become aware of the attitude to adopt during a job interview",
                "Write the documents accompanying an application for employment",
                "Knows the different types of information channels in the company with their advantages and disadvantages.",
                "Know and understand the principles of an advertising approach"
            ],
            "intro": "At the end of the course the student knows"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-MATE-I&courseId=B1C-ALI1-CEGIMT",
        "module": "Mathématiques",
        "course": "Algèbre linéaire 1",
        "grade": 4.7,
        "periods": 64,
        "objectives": {
            "intro": "Le cours ''Algèbre linéaire 1'' constitue le complément du cours ''Analyse 1''. Y sont traîtés les aspects des mathématiques qu'on peut appeler ''géométriques'' dans une acceptation large du terme. En partant d'une approche géométrique intuitive, on développera des notions plus abstraites comme la géométrie vectorielle et analytique et le calcul dans l'ensemble des nombres complexes. La construction de ces notions abstraites se fait à l'appui de nombreux problèmes concrets, par lesquels l'étudiant est amené à s'approprier simultanément les bases théoriques ainsi que les méthodes et outils de calcul. (voir également les objectifs du cours ''Analyse 1'').",
            "list": []
        },
        "contents": [
            {
                "intro": "Trigonométrie, géométrie vectorielle et analytique",
                "list": [
                    "Cercle trigonométrique et fonctions trigonométriques",
                    "Equations et inéquations trigonométriques",
                    "Les différents produits de vecteurs et leurs applications",
                    "Equations analytiques de la droite, du plan, du cercle et de la sphère"
                ]
            },
            {
                "intro": "Nombres complexes",
                "list": [
                    "Les représentations des nombres complexes (forme cartésienne, trigonométrique, exponentielle)",
                    "Le plan de Gauss",
                    "Résolution d'équations complexes",
                    "Applications dans le plan de Gauss et fonctions complexes élémentaires"
                ]
            }
        ],
        "credits": 3.5,
        "year": 1,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits"
        ],
        "teachers": [
            "Christophe Hebeisen"
        ],
        "id": 12,
        "moduleEn": "Mathematics",
        "courseEn": "Linear Algebra 1",
        "contentsEn": [
            {
                "list": [
                    "Trigonometric circle and trigonometric functions",
                    "Trigonometric equations and inequalities",
                    "The different vector products and their applications",
                    "Analytical equations of line, plane, circle and sphere"
                ],
                "intro": "Trigonometry, vector and analytical geometry"
            },
            {
                "list": [
                    "Representations of complex numbers (Cartesian, trigonometric, exponential form)",
                    "The Gauss Plan",
                    "Solving complex equations",
                    "Applications in the Gauss plane and elementary complex functions"
                ],
                "intro": "Complex numbers"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work"
        ],
        "objectivesEn": {
            "list": [],
            "intro": "The course ''Linear Algebra 1'' is the complement of the course ''Analysis 1''. It deals with aspects of mathematics that can be called \"geometrical\" in a broad acceptance of the term. Starting from an intuitive geometric approach, more abstract notions such as vector and analytical geometry and computation in complex numbers will be developed. The construction of these abstract notions is done in support of numerous concrete problems, through which the student is led to simultaneously appropriate the theoretical bases as well as the methods and tools of calculation. (see also the objectives of the course ''Analysis 1'')."
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-MATE-I&courseId=B1C-ANA1-CEGIMT",
        "module": "Mathématiques",
        "course": "Analyse 1",
        "grade": 4.6,
        "periods": 64,
        "objectives": {
            "intro": "Ce cours offre à chaque étudiant-e l'opportunité d'acquérir et de développer des compétences mathématiques. L'enseignement vise l'application des mathématiques dans les branches techniques, et est conçu en vue de rendre l'étudiant-e capable de:",
            "list": [
                "interpréter les représentations mathématiques usuelles dans les domaines techniques étudiés",
                "reproduire une argumentation logique adéquate en utilisant les notions mathématiques sousjacentes",
                "appliquer les méthodes courantes de calcul convenant à la résolution des problèmes posés, tout en utilisant efficacement les outils disponibles, et en particulier le calcul assisté par ordinateur",
                "saisir les limites d'application des algorithmes et des logiciels de calcul, en vérifier les résultats puis juger ceux-ci avec sens critique, selon le domaine d'application",
                "par l'expérimentation, mettre en application de façon autonome les différentes représentations mathématiques afin d'en dégager des conclusions pertinentes selon le contexte",
                "approfondir ultérieurement, par l'étude personnelle, ses connaissances liées à l'utilisation des mathématiques et poursuivre éventuellement ses études"
            ]
        },
        "contents": [
            {
                "intro": "Fonctions, limites et continuité",
                "list": [
                    "Fonctions (algébriques, trigonométriques, transcendantes, définies par morceaux, ...)",
                    "Composition de fonctions",
                    "Fonctions réciproques",
                    "Définition intuitive de la limite et de la continuité d'une fonction",
                    "Propriétés"
                ]
            },
            {
                "intro": "Dérivée et applications",
                "list": [
                    "Pente d'une tangente et définition de la dérivée",
                    "Techniques de dérivation (règles, dérivation en chaîne, implicite, ...)",
                    "Valeurs extrêmes d'une fonction continue, croissance et concavité",
                    "Optimisation et taux liés",
                    "Différentielle et approximation linéaire",
                    "Règle de l'Hospital"
                ]
            }
        ],
        "credits": 3.5,
        "year": 1,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits",
            "Examen: écrit (120 min.)"
        ],
        "teachers": [
            "Micha Wasem"
        ],
        "id": 13,
        "moduleEn": "Mathematics",
        "courseEn": "Calculus 1",
        "contentsEn": [
            {
                "list": [
                    "Functions (algebraic, trigonometric, transcendental, piecewise, ...)",
                    "Composition of functions",
                    "Reciprocal functions",
                    "Intuitive definition of the limit and continuity of a function",
                    "Properties"
                ],
                "intro": "Functions, limits and continuity"
            },
            {
                "list": [
                    "Slope of a tangent and definition of the derivative",
                    "Derivation techniques (rules, chain derivation, implicit, ...)",
                    "Extreme values of a continuous function, growth and concavity",
                    "Optimization and related rates",
                    "Differential and linear approximation",
                    "Hospital Rule"
                ],
                "intro": "Derivatives and applications"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work",
            "Exam: written (120 min.)"
        ],
        "objectivesEn": {
            "list": [
                "to interpret the mathematical representations usual in the technical fields studied",
                "reproduce an adequate logical argument using the underlying mathematical concepts",
                "apply the current methods of calculation appropriate to the solution of the problems posed, while making efficient use of the tools available, and in particular computer-aided calculation",
                "to grasp the limits of application of algorithms and calculation software, to check the results and then to critically evaluate them, depending on the field of application",
                "through experimentation, autonomously apply the different mathematical representations in order to draw relevant conclusions according to the context",
                "to deepen later, through personal study, his knowledge related to the use of mathematics and possibly continue his studies"
            ],
            "intro": "This course offers each student the opportunity to acquire and develop mathematical skills. The teaching is aimed at the application of mathematics in technical branches, and is designed to enable the student to"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-MATE-I&courseId=B1C-ALI2-CEGIMT",
        "module": "Mathématiques",
        "course": "Algèbre linéaire 2",
        "grade": 4.8,
        "periods": 64,
        "objectives": {
            "intro": "Le cours ''Algèbre linéaire 2'' constitue le complément des cours ''Analyse 1 et 2'' et ''Algèbre linéaire 1''. Y sont traîtés les aspects des mathématiques qu'on peut appeler ''géométriques'' dans une acceptation large du terme. En partant d'une approche géométrique intuitive, on développera des notions plus abstraites comme le calcul matriciel, la notion d'espace vectoriel, les transformations d'axes, les valeurs et vecteurs propres. La construction de ces notions abstraites se fait à l'appui de nombreux problèmes concrets, par lesquels l'étudiant est amené à s'approprier simultanément les bases théoriques ainsi que les méthodes et outils de calcul. (voir également les objectifs du cours ''Analyse 1 et 2'').",
            "list": []
        },
        "contents": [
            {
                "intro": "Systèmes d'équations linéaires et calcul matriciel",
                "list": [
                    "Vecteurs de dimension n, produit scalaire et norme",
                    "Algorithme de Gauss et réduction de systèmes d'équations linéaires à la forme échelonnée",
                    "Représentation matricielle d'un système d'équations linéaires et calcul matriciel",
                    "Discussion de systèmes d'équations linéaires sous-déterminés",
                    "Régression (multi-)linéaire par la méthode des moindres carrés"
                ]
            },
            {
                "intro": "Applications linéaires",
                "list": [
                    "Transformations de l'espace (dilatation, rotation, projections, symétries et leurs composées)",
                    "Changement de base et matrice de passage",
                    "Vecteurs propres et valeurs propres",
                    "Diagonalisation et applications"
                ]
            }
        ],
        "credits": 3.5,
        "year": 1,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits",
            "Examen: écrit (120 min.)"
        ],
        "teachers": [
            "Markus Geuss"
        ],
        "id": 14,
        "moduleEn": "Mathematics",
        "courseEn": "Linear Algebra 2",
        "contentsEn": [
            {
                "list": [
                    "n-dimensional vectors, scalar product and standard",
                    "Gaussian algorithm and reduction of systems of linear equations to the stepped shape",
                    "Matrix representation of a system of linear equations and matrix calculation",
                    "Discussion of under-determined systems of linear equations",
                    "Least squares (multi-)linear regression"
                ],
                "intro": "Systems of linear equations and matrix calculation"
            },
            {
                "list": [
                    "Transformations of space (expansion, rotation, projections, symmetries and their compounds)",
                    "Base change and passage matrix",
                    "Own vectors and own values",
                    "Diagonalization and applications"
                ],
                "intro": "Linear applications"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work",
            "Exam: written (120 min.)"
        ],
        "objectivesEn": {
            "list": [],
            "intro": "The course ''Linear Algebra 2'' complements the courses ''Analysis 1 and 2'' and ''Linear Algebra 1''. It deals with aspects of mathematics that can be called \"geometrical\" in a broad acceptance of the term. Starting from an intuitive geometric approach, more abstract notions such as matrix calculation, the notion of vector space, axis transformations, eigenvalues and eigenvectors will be developed. The construction of these abstract notions is done in support of numerous concrete problems, through which the student is led to simultaneously appropriate the theoretical bases as well as the methods and tools of calculation. (see also the objectives of the course ''Analysis 1 and 2'')."
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-MATE-I&courseId=B1C-ANA2-CEGIMT",
        "module": "Mathématiques",
        "course": "Analyse 2",
        "grade": 4.9,
        "periods": 64,
        "objectives": {
            "intro": "Ce cours offre à chaque étudiant-e l'opportunité d'acquérir et de développer des compétences mathématiques. L'enseignement vise l'application des mathématiques dans les branches techniques, et est conçu en vue de rendre l'étudiant-e capable de:",
            "list": [
                "interpréter les représentations mathématiques usuelles dans les domaines techniques étudiés",
                "reproduire une argumentation logique adéquate en utilisant les notions mathématiques sousjacentes",
                "appliquer les méthodes courantes de calcul convenant à la résolution des problèmes posés, tout en utilisant efficacement les outils disponibles, et en particulier le calcul assisté par ordinateur",
                "saisir les limites d'application des algorithmes et des logiciels de calcul, en vérifier les résultats puis juger ceux-ci avec sens critique, selon le domaine d'application",
                "par l'expérimentation, mettre en application de façon autonome les différentes représentations mathématiques afin d'en dégager des conclusions pertinentes selon le contexte",
                "approfondir ultérieurement, par l'étude personnelle, ses connaissances liées à l'utilisation des mathématiques et poursuivre éventuellement ses études"
            ]
        },
        "contents": [
            {
                "intro": "Intégrales",
                "list": [
                    "Primitives d'une fonction et intégrale indéfinie",
                    "Somme de Riemann et intégrale définie",
                    "Théorème fondamental et techniques d'intégration",
                    "Introduction aux équations différentielles",
                    "Applications: calcul d'aires dans le plan, de longueurs, de volumes et surfaces de révolution, notion de travail",
                    "Intégrales impropres"
                ]
            },
            {
                "intro": "Séries infinies",
                "list": [
                    "Les suites et leurs limites",
                    "Définitions et critères de convergence des séries",
                    "Séries de Taylor"
                ]
            }
        ],
        "credits": 3.5,
        "year": 1,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits"
        ],
        "teachers": [
            "Micha Wasem"
        ],
        "id": 15,
        "moduleEn": "Mathematics",
        "courseEn": "Calculus 2",
        "contentsEn": [
            {
                "list": [
                    "Primitives of a function and indefinite integral",
                    "Riemann sum and defined integral",
                    "Fundamental theorem and integration techniques",
                    "Introduction to differential equations",
                    "Applications: calculation of areas in the plane, lengths, volumes and areas of revolution, concept of work.",
                    "Improper integrals"
                ],
                "intro": "Complete"
            },
            {
                "list": [
                    "Consequences and their limits",
                    "Definitions and convergence criteria for the series",
                    "Taylor Series"
                ],
                "intro": "Infinite series"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work"
        ],
        "objectivesEn": {
            "list": [
                "to interpret the mathematical representations usual in the technical fields studied",
                "reproduce an adequate logical argument using the underlying mathematical concepts",
                "apply the current methods of calculation appropriate to the solution of the problems posed, while making efficient use of the tools available, and in particular computer-aided calculation",
                "to grasp the limits of application of algorithms and calculation software, to check the results and then to critically evaluate them, depending on the field of application",
                "through experimentation, autonomously apply the different mathematical representations in order to draw relevant conclusions according to the context",
                "to deepen later, through personal study, his knowledge related to the use of mathematics and possibly continue his studies"
            ],
            "intro": "This course offers each student the opportunity to acquire and develop mathematical skills. The teaching is aimed at the application of mathematics in technical branches, and is designed to enable the student to"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-TNUM-I&courseId=B1C-TNU1-IT",
        "module": "Technique numérique",
        "course": "Technique numérique 1",
        "grade": 5.1,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait",
            "list": [
                "Concevoir et mettre en oeuvre des circuits logiques combinatoires et séquentiels synchrones simples (GATE).",
                "Effectuer les opérations logiques et arithmétiques sur les variables et les nombres binaires entiers et à virgule fixe.",
                "Analyser, synthétiser, simuler, assembler et tester un circuit logique combinatoire.",
                "Analyser, synthétiser, simuler, réaliser et tester un circuit séquentiel simple synchrone.",
                "Mettre en oeuvre les circuits intégrés standard CMOS (portes, bascules, MUX, DEMUX, encodeur).",
                "Simuler et synthétiser des circuits combinatoires décrits en VHDL.",
                "Utiliser quelques instruments de mesures (oscilloscope, générateur de fonctions, ...)."
            ]
        },
        "contents": [
            {
                "intro": "Bloc TN1 : Numération, systèmes combinatoires",
                "list": [
                    "Nombres binaires et opérations arithmétiques",
                    "Opérations et fonctions logiques.",
                    "Analyse et synthèse des fonctions combinatoires.",
                    "Introduction au VHDL pour les circuits combinatoires."
                ]
            },
            {
                "intro": "Bloc TN2 : Systèmes séquentiels synchrones simples",
                "list": [
                    "Analyse des systèmes séquentiels",
                    "Synthèse des systèmes séquentiels synchrones"
                ]
            },
            {
                "intro": "Travaux pratiques:",
                "list": [
                    "Introduction au laboratoire et circuits CMOS standards",
                    "Circuit combinatoire",
                    "Circuit synchrone physique",
                    "Technologie, temps de propagation",
                    "Utilisation d'un oscilloscope: mesure de tensions, de temps.",
                    "Adaptation d'impédance: visualisation des différentes tensions et des temps de propagation des signaux."
                ]
            },
            {
                "intro": "Support de cours",
                "list": [
                    "Polycopié par les professeurs"
                ]
            }
        ],
        "credits": 4,
        "year": 1,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Michael Mäder"
        ],
        "id": 16,
        "moduleEn": "Discrete Electronics",
        "courseEn": "Discrete Electronics 1",
        "contentsEn": [
            {
                "list": [
                    "Binary numbers and arithmetic operations",
                    "Logical operations and functions.",
                    "Analysis and synthesis of combinatorial functions.",
                    "Introduction to VHDL for combinatorial circuits."
                ],
                "intro": "Block TN1: Numbering, Combinatorial Systems"
            },
            {
                "list": [
                    "Analysis of sequential systems",
                    "Synthesis of synchronous sequential systems"
                ],
                "intro": "Block TN2: Simple synchronous sequential systems"
            },
            {
                "list": [
                    "Introduction to the laboratory and standard CMOS circuits",
                    "Combinatorial circuit",
                    "Physical synchronous circuit",
                    "Technology, propagation time",
                    "Use of an oscilloscope: measurement of voltages, time.",
                    "Impedance matching: display of different voltages and signal propagation times."
                ],
                "intro": "Practical work:"
            },
            {
                "list": [
                    "Handout by teachers"
                ],
                "intro": "Course material"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Design and implement simple synchronous combinatorial and sequential logic circuits (GATE).",
                "Perform logical and arithmetic operations on variables and binary integer and fixed-point numbers.",
                "Analyze, synthesize, simulate, assemble and test a combinatorial logic circuit.",
                "Analyze, synthesize, simulate, realize and test a simple sequential synchronous circuit.",
                "Use standard CMOS integrated circuits (gates, flip-flops, MUX, DEMUX, encoder).",
                "Simulate and synthesize combinatorial circuits described in VHDL.",
                "Use some measuring instruments (oscilloscope, function generator, ...)."
            ],
            "intro": "At the end of the course, the student knows"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-TNUM-I&courseId=B1C-TNU2-IT",
        "module": "Technique numérique",
        "course": "Technique numérique 2",
        "grade": 4.7,
        "periods": 52,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait",
            "list": [
                "Concevoir et mettre en oeuvre des systèmes d'électronique numérique dans le domaine des systèmes logiques programmables modélisés en VHDL.",
                "Analyser, synthétiser, simuler, réaliser et tester un circuit séquentiel synchrone avancé.",
                "Analyser, synthétiser, simuler, réaliser et tester un circuit séquentiel asynchrone.",
                "Mettre en oeuvre les circuits intégrés standard CMOS (portes, bascules, MUX, DEMUX, encodeur, arithmétique) et les interfaces avec le monde extérieur et comprendre la technologie ces circuits.",
                "Programmer un circuit logique FPGA.",
                "Utiliser les principaux instruments de mesures (oscilloscope, générateur de fonctions, analyseur logique, ...).",
                "Appliquer les bases de la gestion d'un projet en groupe."
            ]
        },
        "contents": [
            {
                "intro": "Bloc TN3 : Systèmes séquentiels synchrones avancés",
                "list": [
                    "Analyse et synthèse des systèmes séquentiels avancés"
                ]
            },
            {
                "intro": "Bloc TN4 : Systèmes particuliers et technologie",
                "list": [
                    "Analyse et Synthèse des systèmes séquentiels asynchrones.",
                    "Technologie des circuits logiques CMOS.",
                    "Systèmes arithmétiques"
                ]
            },
            {
                "intro": "Bloc TN5 : Systèmes programmables",
                "list": [
                    "Circuits programmables.",
                    "Introduction à la description VHDL."
                ]
            },
            {
                "intro": "Travaux pratiques:",
                "list": [
                    "Circuit synchrone en simulation",
                    "Circuit synchrone physique",
                    "Programmation d'une FPGA"
                ]
            },
            {
                "intro": "Projet intégré:",
                "list": [
                    "Effectuer en groupe.",
                    "Gestion complète d'un projet en groupe (séances, cahier des charges/mode d'emploi, conception, réalisation, tests, documentation et présentation)"
                ]
            },
            {
                "intro": "Support de cours",
                "list": [
                    "Polycopié par les professeurs"
                ]
            }
        ],
        "credits": 4,
        "year": 1,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, projet intégré"
        ],
        "teachers": [
            "Michael Mäder"
        ],
        "id": 17,
        "moduleEn": "Discrete Electronics",
        "courseEn": "Discrete Electronics 2",
        "contentsEn": [
            {
                "list": [
                    "Analysis and synthesis of advanced sequential systems"
                ],
                "intro": "Block TN3: Advanced synchronous sequential systems"
            },
            {
                "list": [
                    "Analysis and Synthesis of Sequential Asynchronous Systems.",
                    "CMOS logic circuit technology.",
                    "Arithmetic systems"
                ],
                "intro": "Block TN4: Special systems and technology"
            },
            {
                "list": [
                    "Programmable circuits.",
                    "Introduction to the VHDL description."
                ],
                "intro": "Block TN5: Programmable Systems"
            },
            {
                "list": [
                    "Synchronous circuit in simulation",
                    "Physical synchronous circuit",
                    "Programming an FPGA"
                ],
                "intro": "Practical work:"
            },
            {
                "list": [
                    "Carry out in a group.",
                    "Complete management of a group project (sessions, specifications/operating instructions, design, production, testing, documentation and presentation)"
                ],
                "intro": "Integrated project:"
            },
            {
                "list": [
                    "Handout by teachers"
                ],
                "intro": "Course material"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, integrated project"
        ],
        "objectivesEn": {
            "list": [
                "Designing and implementing digital electronics systems in the field of programmable logic systems modelled in VHDL.",
                "Analyze, synthesize, simulate, realize and test an advanced synchronous sequential circuit.",
                "Analyze, synthesize, simulate, realize and test an asynchronous sequential circuit.",
                "Implement standard CMOS integrated circuits (gates, flip-flops, MUX, DEMUX, encoder, arithmetic) and interfaces with the outside world and understand the technology of these circuits.",
                "Programming an FPGA logic circuit.",
                "Use the main measuring instruments (oscilloscope, function generator, logic analyzer, ...).",
                "Apply the basics of group project management."
            ],
            "intro": "At the end of the course, the student knows"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-TINF-IT&courseId=B1C-TIN1-IT",
        "module": "Téléinformatique",
        "course": "Téléinformatique 1",
        "grade": 4.2,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant-e est en mesure :",
            "list": [
                "d'expliquer le modèle de référence Internet/OSI et des architectures des réseaux informatiques,",
                "d'effectuer des mesures sur des réseaux locaux (LAN) et de les interpréter,",
                "d'expliquer et d'appliquer les concepts de base de la théorie de l'information et du codage.",
                "d'expliquer les techniques et protocoles utilisés pour le traitement des erreurs de transmission"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Structure des réseaux: topologies, architectures",
                    "Modèle de référence Internet/OSI: définition, communication entre les couches, protocoles, unités de données, services et point d'accès aux services",
                    "Couche physique: débits binaires et de moments, canal de communication, supports physiques, modes de transmission, techniques de multiplexage",
                    "Mécanismes et protocoles pour le traitement des erreurs de transmission et la régulation de flux",
                    "Information et codage: entropie et quantité d'information, codage de voie, codage de source"
                ]
            },
            {
                "intro": "Travaux pratiques:",
                "list": [
                    "Utilisation des analyseurs de protocoles",
                    "Techniques des LANs (Ethernet)",
                    "Transmission asynchrone (interface série)",
                    "Transmission en bande de base",
                    "Source Coding (compression)",
                    "Channel Coding (contrôle d'erreur avec CRC)"
                ]
            }
        ],
        "credits": 4,
        "year": 1,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Rudolf Scheurer"
        ],
        "id": 18,
        "moduleEn": "Networking",
        "courseEn": "Networking 1",
        "contentsEn": [
            {
                "list": [
                    "Network structure: topologies, architectures",
                    "Internet/OSI Reference Model: definition, communication between layers, protocols, data units, services and service access point",
                    "Physical layer: bit and moment rates, communication channel, physical media, transmission modes, multiplexing techniques",
                    "Mechanisms and protocols for transmission error handling and flow control",
                    "Information and coding: entropy and amount of information, channel coding, source coding"
                ]
            },
            {
                "list": [
                    "Use of protocol analyzers",
                    "LAN techniques (Ethernet)",
                    "Asynchronous transmission (serial interface)",
                    "Baseband transmission",
                    "Source Coding (compression)",
                    "Channel Coding (error checking with CRC)"
                ],
                "intro": "Practical work:"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "explain the Internet/OSI reference model and computer network architectures,",
                "perform measurements on local area networks (LANs) and interpret them,",
                "explain and apply the basic concepts of information theory and coding.",
                "explain the techniques and protocols used to deal with transmission errors"
            ],
            "intro": "At the end of the course, the student is able to:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B1M-TINF-IT&courseId=B1C-TIN2-IT",
        "module": "Téléinformatique",
        "course": "Téléinformatique 2",
        "grade": 5.4,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant-e est en mesure de:",
            "list": [
                "expliquer les techniques d'accès au canal et les protocoles de communication de la couche liaison de données",
                "classifier et présenter les principaux algorithmes de routage",
                "énumérer et expliquer les principes et protocoles (réseau, transport et applications) mis en oeuvre dans les réseaux informatiques",
                "décrire et appliquer les structures d'adressage utilisées dans les réseaux informatiques"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Protocoles et mécanismes des couches liaison de données, réseau et transport",
                    "Technologies de réseaux locaux: pile de protocoles Ethernet/TCP/IP",
                    "Adressage : IPv4, classes, adressage privé, introduction à IPv6",
                    "Eléments de réseaux: concentrateurs (hub), ponts (switch), routeurs, serveurs d'adresses",
                    "Protocoles des applications: messagerie électronique (e-mail), transfert de fichiers, terminaux virtuels, http"
                ]
            },
            {
                "intro": "Travaux pratiques:",
                "list": [
                    "Protocole de la couche de données (PPPoE)",
                    "Adressage MAC/IP (ARP)",
                    "Internet: IP, ICMP, fragmentation",
                    "Internet: UDP, TCP",
                    "Applications Internet: Telnet, HTTP, FTP, SMTP",
                    "Gestion d'adresses avec DHCP"
                ]
            }
        ],
        "credits": 4,
        "year": 1,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports",
            "Examen: oral (15 min.)"
        ],
        "teachers": [
            "Rudolf Scheurer"
        ],
        "id": 19,
        "moduleEn": "Networking",
        "courseEn": "Networking 2",
        "contentsEn": [
            {
                "list": [
                    "Protocols and mechanisms of the data link, network and transport layers",
                    "Local area network technologies: Ethernet/TCP/IP protocol stack",
                    "Addressing: IPv4, classes, private addressing, introduction to IPv6",
                    "Network elements: hubs, bridges, switches, routers, address servers, etc.",
                    "Application protocols: e-mail, file transfer, virtual terminals, http, etc."
                ]
            },
            {
                "list": [
                    "Data Layer Protocol (PPPoE)",
                    "MAC/IP addressing (ARP)",
                    "Internet: IP, ICMP, fragmentation",
                    "Internet: UDP, TCP",
                    "Internet applications: Telnet, HTTP, FTP, SMTP",
                    "Address management with DHCP"
                ],
                "intro": "Practical work:"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports",
            "Exam: oral (15 min.)"
        ],
        "objectivesEn": {
            "list": [
                "explain the channel access techniques and communication protocols of the data link layer",
                "classify and present the main routing algorithms",
                "list and explain the principles and protocols (network, transport and applications) implemented in computer networks",
                "describe and apply the addressing structures used in computer networks"
            ],
            "intro": "At the end of the course, the student is able to:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-ALBG-I&courseId=B2C-ALG2-I",
        "module": "Algorithmique, Base de données, Génie Logiciel",
        "course": "Algorithmique et structures de données 2",
        "grade": 5.5,
        "periods": 64,
        "objectives": {
            "intro": "Les objectifs sont les mêmes que ceux du cours algorithmique et structures de données 1, mais ils s'appliquent à un domaine de connaissances plus vaste.",
            "list": [
                "Analyser un problème informatique, et concevoir un algorithme pour le résoudre.",
                "Ecrire et utiliser des structures de données complexes, et des algorithmes non triviaux.",
                "Analyser la complexité théorique d'un programme et la vérifier expérimentalement.",
                "Réfléchir de façon abstraite, en distinguant spécification et implémentation, et en s'aidant de formalismes adéquats (esquisses, pseudo-code, ...).",
                "Utiliser un environnement de développement logiciel pour un langage orienté objet, et les outils du programmeur (tests, profileur, aide au diagnostic, debugger...)."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Complexité amortie, complexité espérée.",
                    "Arbre, parcours, heap, skew-heap, arbre de fouille (binary search tree), arbres-splay, treap, B-arbres.",
                    "Ensembles disjoints, simulation discrète, string searching, distance d'édition, compression (Huffman, LempelZiv)",
                    "Pseudo-pointeurs, généricité, quelques algorithmes astucieux, tests et outils du programmeur"
                ]
            }
        ],
        "credits": 3.5,
        "year": 2,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Frédéric Bapst"
        ],
        "id": 20,
        "moduleEn": "Algorithmic, Database, Software Engineering",
        "courseEn": "Data Structures and Algorithms 2 & Labs",
        "contentsEn": [
            {
                "list": [
                    "Damped complexity, expected complexity.",
                    "Arbre, parcours, heap, skew-heap, arbre de fouille (binary search tree), arbres-splay, treap, B-arbres.",
                    "Disjoint sets, discrete simulation, string searching, editing distance, compression (Huffman, LempelZiv)",
                    "Pseudo-pointers, generality, some clever algorithms, tests and programmer's tools"
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Analyze a computer problem, and design an algorithm to solve it.",
                "Write and use complex data structures and non-trivial algorithms.",
                "Analyze the theoretical complexity of a program and verify it experimentally.",
                "Thinking in an abstract way, distinguishing between specification and implementation, and using adequate formalisms (sketches, pseudo-code, ...).",
                "Use a software development environment for an object-oriented language, and the programmer's tools (tests, profiler, diagnostic help, debugger...)."
            ],
            "intro": "The objectives are the same as those of the Algorithms and Data Structures 1 course, but they apply to a broader area of knowledge."
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-ALBG-I&courseId=B2C-SGBD-I",
        "module": "Algorithmique, Base de données, Génie Logiciel",
        "course": "Bases de données 1",
        "grade": 5.3,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Utiliser un modèle de données pour la conception et le développement d'applications base de données.",
                "Concevoir et implémenter une base de données relationnelle et en représenter la structure à l'aide d'un formalisme adéquat.",
                "Maitriser les différentes parties du SQL (LMD, LDD, LCD, trigger,procédures stockées, curseurs,SQL dynamique)"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Introduction générale aux SGBDs.",
                    "Fonctions d'un système de gestion de bases de données (indépendances logique et physique, cohérence des données, partageabilité des données, non redondance des données, sécurité des données, efficacité des accès aux données).",
                    "Modèle de donnée entité-association.",
                    "Modèle relationnel et algèbre relationnelle",
                    "Passage du modèle entité-association au modèle relationnel.",
                    "Langage de définition, de manipulation et de contrôle de données SQL.",
                    "SQL étendu: trigger, procédure stockée",
                    "SQL dynamique.",
                    "Comprendre et éviter l'injection SQL"
                ]
            }
        ],
        "credits": 4,
        "year": 2,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Houda Chabbi"
        ],
        "id": 21,
        "moduleEn": "Algorithmic, Database, Software Engineering",
        "courseEn": "Databases 1",
        "contentsEn": [
            {
                "list": [
                    "General introduction to DBMS.",
                    "Functions of a database management system (logical and physical independence, data consistency, data sharability, non-redundancy of data, data security, efficiency of data access).",
                    "Entity-association data model.",
                    "Relational model and relational algebra",
                    "Transition from the entity-association model to the relational model.",
                    "Language for defining, manipulating and controlling SQL data.",
                    "Extended SQL: trigger, stored procedure",
                    "Dynamic SQL.",
                    "Understanding and avoiding SQL injection"
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Use a data model for the design and development of database applications.",
                "Design and implement a relational database and represent its structure using an adequate formalism.",
                "Master the different parts of SQL (LMD, LDD, LCD, trigger, stored procedures, cursors, dynamic SQL)"
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-ALBG-I&courseId=B2C-GELO-I",
        "module": "Algorithmique, Base de données, Génie Logiciel",
        "course": "Génie Logiciel 1",
        "grade": 5.4,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours l'étudiant sait:",
            "list": [
                "Utiliser un sous-ensemble d'UML",
                "Utiliser un outil pour la génération de diagrammes UML",
                "Analyser, concevoir et implémenter des applications simples en utilisant une approche orientée objet et UML",
                "Aborder un projet informatique de manière rigoureuse"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Motivation du génie logiciel",
                    "Principe de la modèlisation orientée objet",
                    "Principaux diagrammes UML",
                    "Utilisation d'un outil pour la modèlisation avec UML"
                ]
            }
        ],
        "credits": 4,
        "year": 2,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: TP/évaluation de rapports, épreuves orales ou écrites"
        ],
        "teachers": [
            "Pierre Kuonen",
            "Elena Mugellini"
        ],
        "id": 22,
        "moduleEn": "Algorithmic, Database, Software Engineering",
        "courseEn": "Software Engineering 1",
        "contentsEn": [
            {
                "list": [
                    "Software Engineering Motivation",
                    "Principle of object-oriented modeling",
                    "Main UML diagrams",
                    "Using a tool for modeling with UML"
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: TP/evaluation of reports, oral or written tests"
        ],
        "objectivesEn": {
            "list": [
                "Using a subset of UML",
                "Using a tool for generating UML diagrams",
                "Analyze, design and implement simple applications using an object-oriented and UML approach",
                "Rigorous approach to an IT project"
            ],
            "intro": "At the end of the course the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-ALBG-I&courseId=B2C-ALG3-I",
        "module": "Algorithmique, Base de données, Génie Logiciel",
        "course": "Algorithmique et structures de données 3",
        "grade": 5,
        "periods": 96,
        "objectives": {
            "intro": "Les objectifs sont les mêmes que ceux du cours algorithmique et structures de données 2, mais ils s'appliquent à un domaine de connaissances plus vaste.",
            "list": [
                "Analyser un problème informatique, et concevoir un algorithme pour le résoudre.",
                "Ecrire et utiliser des structures de données complexes, et des algorithmes non triviaux.",
                "Analyser la complexité théorique d'un programme et la vérifier expérimentalement.",
                "Réfléchir de façon abstraite, en distinguant spécification et implémentation, et en s'aidant de formalismes adéquats (esquisses, pseudo-code, ...).",
                "Utiliser un environnement de développement logiciel pour un langage orienté objet, et les outils du programmeur (tests, profileur, aide au diagnostic, debugger...)."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Graphe, parcours, algorithmes de plus court chemin, flux et coupures dans un réseau, connectivité, arbre de recouvrement, tri topologique. Quelques autres concepts (clique, matching, coloration, bipartite, condensation...).",
                    "Bactracking, alpha/beta",
                    "Géométrie calculatoire : primitives, sens de rotation, technique de balayage, point dans un polygone, carte polygonale, RangeTree, IntervalTree, dualité, clustering.",
                    "Optimisation de code. Bytecode Java (concepts et outils)"
                ]
            }
        ],
        "credits": 5.5,
        "year": 2,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports",
            "Examen: écrit (120 min.)"
        ],
        "teachers": [
            "Frédéric Bapst"
        ],
        "id": 23,
        "moduleEn": "Algorithmic, Database, Software Engineering",
        "courseEn": "Data Structures and Algorithms 3 & Labs",
        "contentsEn": [
            {
                "list": [
                    "Graph, path, shortest path algorithms, flows and breaks in a network, connectivity, overlay tree, topological sorting. Some other concepts (click, matching, coloring, bipartite, condensation...).",
                    "Bactracking, alpha/beta",
                    "Computational geometry: primitives, direction of rotation, scanning technique, point in a polygon, polygon map, RangeTree, IntervalTree, duality, clustering.",
                    "Code optimization. Java bytecode (concepts and tools)"
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports",
            "Exam: written (120 min.)"
        ],
        "objectivesEn": {
            "list": [
                "Analyze a computer problem, and design an algorithm to solve it.",
                "Write and use complex data structures and non-trivial algorithms.",
                "Analyze the theoretical complexity of a program and verify it experimentally.",
                "Think in an abstract way, distinguishing between specification and implementation, and using adequate formalisms (sketches, pseudo-code, ...).",
                "Use a software development environment for an object-oriented language, and the programmer's tools (tests, profiler, diagnostic help, debugger...)."
            ],
            "intro": "The objectives are the same as those of the Algorithms and Data Structures 2 course, but they apply to a broader area of knowledge."
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-MSCI-I&courseId=B2C-MAS1-I",
        "module": "Maths et Sciences pour Informaticiens",
        "course": "Mathématiques spécifiques 1",
        "grade": 5,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours l'étudiant-e connaît",
            "list": [
                "quelques méthodes mathématiques du ''machine learning''",
                "quelques aspects des mathématiques discrètes"
            ]
        },
        "contents": [
            {
                "intro": "Machine learning",
                "list": [
                    "fonctions de plusieurs variables",
                    "gradient",
                    "optimisation (sous contraintes)",
                    "descente du gradient",
                    "..."
                ]
            },
            {
                "intro": "Mathématiques discrètes",
                "list": [
                    "relations d'équivalence",
                    "séries génératrices",
                    "récurrences linéaires",
                    "logique du premier ordre"
                ]
            }
        ],
        "credits": 3.5,
        "year": 2,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits",
            "Examen: écrit (120 min.)"
        ],
        "teachers": [
            "Roseline Nussbaumer"
        ],
        "id": 24,
        "moduleEn": "Mathematics and Sciences for Computer Scientists",
        "courseEn": "Specialized Mathematics 1",
        "contentsEn": [
            {
                "list": [
                    "multivariate functions",
                    "gradient",
                    "optimization (under constraints)",
                    "gradient descent",
                    "..."
                ],
                "intro": "Machine learning"
            },
            {
                "list": [
                    "equity relationships",
                    "generating sets",
                    "linear recurrences",
                    "first-order logic"
                ],
                "intro": "Discrete Mathematics"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work",
            "Exam: written (120 min.)"
        ],
        "objectivesEn": {
            "list": [
                "some mathematical methods of machine learning.",
                "some aspects of discrete mathematics"
            ],
            "intro": "At the end of the course the student will know"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-MSCI-I&courseId=B2C-STAT-I",
        "module": "Maths et Sciences pour Informaticiens",
        "course": "Statistiques",
        "grade": 4.5,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant-e sait:",
            "list": [
                "Comprendre et construire une distribution empirique de données.",
                "Calculer les principales caractéristiques d'une distribution.",
                "Calculer une probabilité d'occurrence d'un événement.",
                "Déterminer la dépendance stochastique d'événements et en calculer la probabilité conditionnelle.",
                "Choisir judicieusement la loi statistique fondamentale (binomiale, géométrique, de Poisson, exponentielle, hypergéométrique, normale) qui modélise une épreuve aléatoire donnée.",
                "Estimer les paramètres d'un modèle statistique.",
                "Comprendre le rôle de la statistique inférentielle."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Statistique descriptive: applications, traitement de données aléatoires, extractions de valeurs caractéristiques (moyenne, variance, écart type, coefficient de corrélation), extraction par simulation.",
                    "Probabilités: définitions, algèbre des événements, analyse combinatoire (permutations, arrangements, combinaisons, avec ou sans répétitions), calcul des probabilités (définitions, proba. conditionnelle), variables aléatoires (définitions, variables discrètes et continues, fonctions de répartition, espérance mathématique, variance), lois fondamentales (binomiale, géométrique, de Poisson, exponentielle, hypergéométrique, normale).",
                    "Calcul d'erreur (intervalle de confiance).",
                    "Régression linéaire (approche matricielle) et/ou introduction aux tests d'hypothèses."
                ]
            }
        ],
        "credits": 1.5,
        "year": 2,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits"
        ],
        "teachers": [
            "Christophe Hebeisen"
        ],
        "id": 25,
        "moduleEn": "Mathematics and Sciences for Computer Scientists",
        "courseEn": "Statistics",
        "contentsEn": [
            {
                "list": [
                    "Descriptive statistics: applications, random data processing, extraction of characteristic values (mean, variance, standard deviation, correlation coefficient), extraction by simulation.",
                    "Probabilities: definitions, algebra of events, combinatorial analysis (permutations, arrangements, combinations, with or without repetitions), probability calculus (definitions, conditional proba.), random variables (definitions, discrete and continuous variables, distribution functions, mathematical expectation, variance), fundamental laws (binomial, geometric, Poisson's, exponential, hypergeometric, normal).",
                    "Error calculation (confidence interval).",
                    "Linear regression (matrix approach) and/or introduction to hypothesis testing."
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work"
        ],
        "objectivesEn": {
            "list": [
                "Understand and construct an empirical data distribution.",
                "Calculate the main characteristics of a distribution.",
                "Calculate a probability of occurrence of an event.",
                "Determine the stochastic dependence of events and calculate the conditional probability of events.",
                "Choose wisely the fundamental statistical law (binomial, geometric, Poisson's, exponential, hypergeometric, normal) that models a given random test.",
                "Estimate the parameters of a statistical model.",
                "Understand the role of inferential statistics."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-MSCI-I&courseId=B2C-MAS2-I",
        "module": "Maths et Sciences pour Informaticiens",
        "course": "Mathématiques spécifiques 2",
        "grade": 5.4,
        "periods": 64,
        "objectives": {
            "intro": "Aspects mathématiques: a la fin du cours, l'étudiant-e connaît",
            "list": [
                "quelques méthodes de la théorie des nombres, ainsi que plusieurs applications (par exemple, en cryptographie).",
                "quelques méthodes standard des mathématiques numériques",
                "utiliser les automates finis, les expressions régulières, et les diagrammes syntaxiques pour décrire un langage;",
                "utiliser l'algorithme de descente récursive pour programmer un analyseur de langage;",
                "manipuler les assertions pour vérifier des propriétés dans un programme;",
                "manipuler des formules de logique temporelle (LTL)",
                "manipuler les concepts liés aux limites de la calculabilité (machines de Turing, indécidabilité, NP-complet)."
            ]
        },
        "contents": [
            {
                "intro": "Mathématiques discrètes",
                "list": [
                    "Initiation à la théorie des nombres (modules, tests de primalité etc.).",
                    "Bases de la théorie de l'information de Shannon.",
                    "Bases de la cryptographie moderne (' public key ', ' zero knowledge ' etc.)."
                ]
            },
            {
                "intro": "Mathématiques numériques",
                "list": [
                    "Technique de recherche de zéros de fonctions non-linéaires",
                    "Algorithme du simplexe",
                    "Les erreurs inévitables sur l'ordinateur (nombres à virgule flottante ...)",
                    "Interpolations polynomiales, linéaires, splines et courbes de Bézier"
                ]
            },
            {
                "intro": "Aspects formels des langages :",
                "list": [
                    "notion d'alphabet, langage, opérateurs sur les langages (union, intersection, concaténation, fermeture de Kleene);",
                    "automates d'états finis déterministes, langages réguliers, expressions régulières;",
                    "diagrammes syntaxiques, notation EBNF, dérivation, symboles terminaux et non terminaux;",
                    "analyse lexicale/syntaxique/sémantique, interprétation de langages, algorithme de descente récursive, analyse d'expressions arithmétiques;",
                    "propriétés formelles des programme, preuves de programme, assertions, invariants, pré/post conditions, JML, logique propositionnelle et temporelle;",
                    "machines de Turing, problèmes indécidables, classes P, NP, et NP-complet."
                ]
            }
        ],
        "credits": 3,
        "year": 2,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits"
        ],
        "teachers": [
            "Rudolf Riedi"
        ],
        "id": 26,
        "moduleEn": "Mathematics and Sciences for Computer Scientists",
        "courseEn": "Specialized Mathematics 2",
        "contentsEn": [
            {
                "list": [
                    "Introduction to number theory (modules, primality tests etc.).",
                    "Basics of Shannon's information theory.",
                    "Bases de la cryptographie moderne (' public key ', ' zero knowledge ' etc.)."
                ],
                "intro": "Discrete Mathematics"
            },
            {
                "list": [
                    "Technique for searching zeros of non-linear functions",
                    "Simplex algorithm",
                    "Unavoidable errors on the computer (floating point numbers ...)",
                    "Polynomial, linear, spline and Bézier curve interpolations"
                ],
                "intro": "Digital Mathematics"
            },
            {
                "list": [
                    "notion of alphabet, language, operators on languages (union, intersection, concatenation, Kleene closure);",
                    "deterministic finite state automata, regular languages, regular expressions;",
                    "syntax diagrams, EBNF notation, derivation, terminal and non-terminal symbols;",
                    "lexical/syntactic/semantic analysis, language interpretation, recursive descent algorithm, arithmetic expression analysis;",
                    "formal program properties, program proofs, assertions, invariants, pre/post conditions, JML, propositional and temporal logic;",
                    "Turing machines, undecidable problems, classes P, NP, and NP-complete."
                ],
                "intro": "Formal aspects of languages :"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work"
        ],
        "objectivesEn": {
            "list": [
                "some methods of number theory, as well as several applications (e.g. in cryptography).",
                "some standard methods of numerical mathematics",
                "use finite automata, regular expressions, and syntactic diagrams to describe a language;",
                "use the recursive descent algorithm to program a language analyzer;",
                "manipulate assertions to verify properties in a program;",
                "manipulate time logic (LTL) formulas",
                "manipulate concepts related to the limits of computability (Turing machines, indecidability, NP-complete)."
            ],
            "intro": "Mathematical aspects: at the end of the course, the student will know"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-MSCI-I&courseId=B2C-PYSM-I",
        "module": "Maths et Sciences pour Informaticiens",
        "course": "Physique SIAM",
        "grade": 4.4,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Expliquer les principes de base régissant un phénomène physique observé.",
                "Mesurer les grandeurs physiques décrivant un phénomène physique observé.",
                "Elaborer un modèle simple d'un système physique observé et en calculer les paramètres.",
                "Est familiarisé avec les principes de base des phénomènes de vitesse, accélération, forces, énergie; connais les notions d'ondes électromagnétiques",
                "Est capable d'expliquer et d'implémenter en simulations les lois physiques étudiés."
            ]
        },
        "contents": [
            {
                "intro": "Cinématique",
                "list": []
            },
            {
                "intro": null,
                "list": [
                    "Vitesse: constante; instantanée - dérivée; moyenne; mouvement relatif",
                    "Accélération: moyenne; instantanée",
                    "Chute libre et jet oblique",
                    "MRU et MRUA"
                ]
            },
            {
                "intro": "Forces:",
                "list": [
                    "3 lois de Newton: loi d'inertie; force, masse, quantité de mouvement; action-réaction",
                    "Dynamique des forces",
                    "Force gravitationnelle"
                ]
            },
            {
                "intro": "Energie",
                "list": [
                    "Notion de travail",
                    "Puissance",
                    "Energie mécanique: cinétique, potentielle"
                ]
            },
            {
                "intro": "Oscillations, ondes",
                "list": [
                    "Notion d'onde électromagnétique",
                    "Fréquence",
                    "Phase",
                    "lumière, son; vitesse de propagation"
                ]
            },
            {
                "intro": "Electricité (rappels de l'apprentissage)",
                "list": [
                    "Loi d'Ohm; puissance; circuits de base; Résistances en parallèle et en série"
                ]
            },
            {
                "intro": "Eventuellement",
                "list": [
                    "Statique des solides",
                    "Fluides: Archimède, Pascal"
                ]
            },
            {
                "intro": "Travaux pratiques:",
                "list": []
            }
        ],
        "credits": 4,
        "year": 2,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Ales Janka"
        ],
        "id": 27,
        "moduleEn": "Mathematics and Sciences for Computer Scientists",
        "courseEn": "Physics SIAM",
        "contentsEn": [
            {
                "list": [],
                "intro": "Kinematics"
            },
            {
                "list": [
                    "Speed: constant; instantaneous - derivative; average; relative motion",
                    "Acceleration: medium; instantaneous",
                    "Free fall and oblique jet",
                    "MRU and MRUA"
                ]
            },
            {
                "list": [
                    "3 Newton's laws: law of inertia; force, mass, quantity of motion; action-reaction.",
                    "Force Dynamics",
                    "Gravitational force"
                ],
                "intro": "Forces:"
            },
            {
                "list": [
                    "Notion of work",
                    "Power",
                    "Mechanical energy: kinetic, potential"
                ],
                "intro": "Energy"
            },
            {
                "list": [
                    "Notion of electromagnetic wave",
                    "Frequency",
                    "Phase",
                    "light, sound; speed of propagation"
                ],
                "intro": "Oscillations, waves"
            },
            {
                "list": [
                    "Ohm's law; power; basic circuits; parallel and series resistors"
                ],
                "intro": "Electricity (learning reminders)"
            },
            {
                "list": [
                    "Solids Statics",
                    "Fluids: Archimedes, Pascal"
                ],
                "intro": "Possibly"
            },
            {
                "list": [],
                "intro": "Practical work:"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Explain the basic principles governing an observed physical phenomenon.",
                "To measure physical quantities describing an observed physical phenomenon.",
                "Develop a simple model of an observed physical system and calculate its parameters.",
                "Is familiar with the basic principles of the phenomena of speed, acceleration, forces, energy; knows the concepts of electromagnetic waves.",
                "Is able to explain and implement in simulations the studied physical laws."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "module": "Projet et Gestion de projets",
        "course": "Betriebswirtschaft",
        "grade": 5.3,
        "contents": [
            {
                "list": [
                    "Das Unternehmen und sein Umfeld (Rahmenbedingungen, Aufbau, Funktionen, Beziehungen, Rechtsformen etc.)",
                    "Finanzielle Aspekte (Übergeordnete Ziele, Investition, Finanzierung)",
                    "Buchhalterische Aspekte (Buchführung, Bilanz, ER, Analyse)",
                    "Unternehmensführung (Managementfunktionen, HR)",
                    "Management-Techniken (Analysemethoden, Szenarien)"
                ]
            }
        ],
        "credits": 1.5,
        "year": 2,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, présentations"
        ],
        "teachers": [
            "Alfred Münger"
        ],
        "id": 28,
        "moduleEn": "Project and Project Management",
        "courseEn": "Business Management",
        "contentsEn": [
            {
                "list": [
                    "The company and its environment (general conditions, structure, functions, relationships, legal forms etc.)",
                    "Financial aspects (overall objectives, investment, financing)",
                    "Accounting aspects (bookkeeping, balance sheet, ER, analysis)",
                    "Corporate management (management functions, HR)",
                    "Management techniques (analysis methods, scenarios)"
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, presentations"
        ]
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-GPEE-I&courseId=B2C-GPIT-IT",
        "module": "Projet et Gestion de projets",
        "course": "Projektmanagement ICT",
        "grade": 5.2,
        "periods": 24,
        "objectives": {
            "intro": "A la fin du cours l'étudiant est capable de:",
            "list": [
                "comprendre les cycles de vie des projets TIC",
                "s'intégrer et collaborer dans une équipe qui utilise des méthodologies de gestion de projet de type waterfall et agile",
                "utiliser des méthodologies et outils classiques utilisés pour la gestion des projets TIC"
            ]
        },
        "contents": [
            {
                "intro": "Fondamentaux de la gestion de projet",
                "list": [
                    "Structure des organisations",
                    "Triangle des contraintes",
                    "Autres notions fondamentales"
                ]
            },
            {
                "intro": "Cycle de vie projet - vision orientée client",
                "list": [
                    "Approche en 5 phases - vue générale",
                    "Phase 1 - stratégie : pourquoi réaliser ce projet, que réaliser dans ce projet, choix parmi des alternatives",
                    "Phase 2 - tactique : comment réaliser ce projet, analyse détaillée des besoins, proposer une planification, énoncer une proposition de cahier des charges",
                    "Phase 3 - exécution : supervision de l'exécution d'un projet réalisé à travers le cycle de vie produit (voir Section 3)",
                    "Phase 4 - mise en production : actions avant/pendant/après la mise en production",
                    "Phase 5 - clôture et évaluation du projet : que signifie clôturer un projet"
                ]
            },
            {
                "intro": "Cycle de vie produit - vision orientée équipe de développement",
                "list": [
                    "Approche en 4 phases - vue générale : pourquoi 2 cycles de vie, séquencement des phases (cascade), itérations sur les phases (agilité)",
                    "Phase 1 - analyse : quels sont les résultats attendus, vue externe du produit, approche par backlog de fonctionnalités, listing des propriétés et contraintes du produit",
                    "Phase 2 - conception : comment réaliser les fonctionnalités, vue interne du produit, architecture, utilisation de langages de modélisation (BPMN, UML)",
                    "Phase 3 - implémentation",
                    "Phase 4 - tests"
                ]
            },
            {
                "intro": "Rôles dans la gestion de projet",
                "list": [
                    "Rôles en lien avec le cycle de vie projet",
                    "Rôles en lien avec le cycle de vie produit : rôles traditionnels, rôles agiles"
                ]
            },
            {
                "intro": "Outils",
                "list": [
                    "Gestion des séances : ordre du jour, pv",
                    "Planification : Gantt, techniques d'estimation des tâches, découpage Work Breakdown Structure, approche par WP, livrables et jalons",
                    "Reporting : techniques d'écriture, structure des documents"
                ]
            }
        ],
        "credits": 2,
        "year": 2,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Andreas Fischer"
        ],
        "id": 29,
        "moduleEn": "Project and Project Management",
        "courseEn": "Project Management ICT",
        "contentsEn": [
            {
                "list": [
                    "Organizational Structure",
                    "Stress Triangle",
                    "Other basic concepts"
                ],
                "intro": "Project Management Fundamentals"
            },
            {
                "list": [
                    "5-phase approach - overview",
                    "Phase 1 - strategy: why carry out this project, what to achieve in this project, choice among alternatives",
                    "Phase 2 - tactics: how to carry out this project, detailed needs analysis, propose planning, draft specifications",
                    "Phase 3 - Execution: overseeing the execution of a project across the product life cycle (see Section 3)",
                    "Phase 4 - production start-up: actions before/during/after production start-up",
                    "Phase 5 - Project Closure and Evaluation: What does it mean to close a project?"
                ],
                "intro": "Project lifecycle - customer-oriented vision"
            },
            {
                "list": [
                    "4 phase approach - overview: why 2 life cycles, phase sequencing (cascade), iterations on phases (agility)",
                    "Phase 1 - analysis: what are the expected results, external view of the product, backlog approach of functionalities, listing of product properties and constraints",
                    "Phase 2 - design: how to realize the functionalities, internal view of the product, architecture, use of modeling languages (BPMN, UML)",
                    "Phase 3 - implementation",
                    "Phase 4 - tests"
                ],
                "intro": "Product lifecycle - team-oriented development vision"
            },
            {
                "list": [
                    "Roles related to the project life cycle",
                    "Roles related to the product life cycle: traditional roles, agile roles"
                ],
                "intro": "Roles in Project Management"
            },
            {
                "list": [
                    "Session management: agenda, pv",
                    "Planning: Gantt, task estimation techniques, Work Breakdown Structure, WP approach, deliverables and milestones",
                    "Reporting: writing techniques, document structure"
                ],
                "intro": "Tools"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "understanding the life cycles of ICT projects",
                "Integrate and collaborate in a team that uses waterfall and agile project management methodologies.",
                "use traditional methodologies and tools used for the management of ICT projects"
            ],
            "intro": "At the end of the course the student is able to:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-GPEE-I&courseId=B2C-ALGP-I",
        "module": "Projet et Gestion de projets",
        "course": "Projet de semestre",
        "grade": 5.7,
        "periods": 32,
        "objectives": {
            "intro": "",
            "list": [
                "Travailler en groupe, organiser des séances de travail",
                "S'intégrer à une équipe de développement",
                "Réaliser un projet impliquant des questions algorithmiques (et structures de données)",
                "Appliquer dans un projet des notions acquises dans d'autres cours (interface homme-machine, programmation concurrente, génie logiciel, téléinformatique, maths, communication...)",
                "Respecter une spécification imposée",
                "Maîtriser et affiner une découpe modulaire (API)",
                "Reconnaître les difficultés d'un projet en vraie grandeur (plusieurs équipes de développement)",
                "Appliquer les notions de gestion de projet, et produire les documents correspondants (planning, journal de bord, PVs, documentation technique)",
                "Rédiger un rapport de projet",
                "Respecter des échéances",
                "Exploiter des outils de gestion des versions",
                "Tester un module existant"
            ]
        },
        "contents": [
            {
                "intro": "Pour le projet de semestre, les professeurs forment des groupes de 3-6 personnes. Le projet porte généralement sur la réalisation informatique d'un jeu (p. ex. jass, dots-and-boxes, bataille navale...). Tous les groupes respectent une spécification commune, ce qui permet d'échanger les modules et de confronter les résultats (p. ex. les stratégies du joueur automatique). Le sujet permet de développer les aspects ludiques, créatifs, et l'esprit de compétition. En plus des deux périodes à l'horaire hebdomadaire, on compte au moins deux autres périodes de travail prises sur le temps libre de l'étudiant.",
                "list": []
            }
        ],
        "credits": 2.5,
        "year": 2,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Frédéric Bapst",
            "Sandy Ingram",
            "François Kilchoer"
        ],
        "id": 30,
        "moduleEn": "Project and Project Management",
        "courseEn": "Semester Project",
        "contentsEn": [
            {
                "list": [],
                "intro": "For the semester project, teachers form groups of 3-6 people. The project generally involves the computer production of a game (e.g. jass, dots-and-boxes, naval battle...). All groups follow a common specification, which allows the modules to be exchanged and the results to be compared (e.g. the strategies of the automatic player). The subject allows to develop the playful, creative and competitive aspects. In addition to the two weekly scheduled periods, there are at least two other work periods taken from the student's free time."
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Ongoing monitoring: TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Work in groups, organize working sessions",
                "Joining a development team",
                "Carry out a project involving algorithmic issues (and data structures)",
                "Apply in a project concepts acquired in other courses (human-machine interface, concurrent programming, software engineering, teleinformatics, maths, communication, etc.).",
                "Comply with a prescribed specification",
                "Mastering and refining a modular cutting (PLC)",
                "Recognize the difficulties of a full-scale project (several development teams)",
                "Apply the notions of project management, and produce the corresponding documents (schedule, logbook, reports, technical documentation).",
                "Write a project report",
                "Meeting deadlines",
                "Leverage version management tools",
                "Testing an existing module"
            ]
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-SIAM-I&courseId=B2C-PRC1-I",
        "module": "Systèmes d'Information et Applications Mobiles",
        "course": "Programmation concurrente 1",
        "grade": 5.2,
        "periods": 48,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Analyser un problème informatique et juger de la nécessité d'une approche concurrente.",
                "Concevoir un programme concurrent en identifiant, sur la base de critères objectifs, les différents processus et leur interaction.",
                "Utiliser à bon escient les outils de synchronisation entre processus.",
                "Appliquer les règles permettant d'éviter interblocage et privation.",
                "Représenter une application concurrente à l'aide d'un formalisme adéquat.",
                "Simuler à l'aide d'un formalisme adéquat le comportement dynamique d'un programme concurrent."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Introduction: première approche, définitions, caractéristiques et modèle.",
                    "Exclusion mutuelle: problématique, réalisation (attente active, verrous).",
                    "Synchronisation: problématique, réalisation (sémaphores, moniteurs)",
                    "Langages/environnements de développement qui supportent de multiples processus: JR, Java, pthreads, etc"
                ]
            }
        ],
        "credits": 4,
        "year": 2,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports",
            "Examen: oral (15 min.)"
        ],
        "teachers": [
            "François Kilchoer"
        ],
        "id": 31,
        "moduleEn": "Information Systems and Mobile Applications",
        "courseEn": "Concurrent Programming 1",
        "contentsEn": [
            {
                "list": [
                    "Introduction: first approach, definitions, characteristics and model.",
                    "Mutual exclusion: problems, implementation (active waiting, locks).",
                    "Synchronization: problems, realization (semaphores, monitors)",
                    "Development languages/environments that support multiple processes: JR, Java, pthreads, etc."
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports",
            "Exam: oral (15 min.)"
        ],
        "objectivesEn": {
            "list": [
                "Analyze an IT problem and judge the need for a concurrent approach.",
                "Design a competing program by identifying, based on objective criteria, the different processes and their interaction.",
                "Make good use of synchronization tools between processes.",
                "Apply rules to avoid interlocking and deprivation.",
                "Represent a competing application using appropriate formalism.",
                "To simulate the dynamic behaviour of a competing program using an appropriate formalism."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-SIAM-I&courseId=B2C-DMOB-I",
        "module": "Systèmes d'Information et Applications Mobiles",
        "course": "Applications Mobiles 1",
        "grade": 5.1,
        "periods": 64,
        "objectives": {
            "intro": "Les objectifs principaux du cours sont:",
            "list": [
                "Comprendre les concepts de base de la programmation sur appareils mobiles à travers les 2 plateformes principales Android et IOS.",
                "Connaitre les composants principaux des platerformes Android et IOS",
                "Savoir développer des applications sur les 2 plateformes ainsi que les déployer sur les smartphones et tablettes"
            ]
        },
        "contents": [
            {
                "intro": "A travers ce cours l'étudiant se familiarisera avec les concepts mobiles Android:",
                "list": []
            },
            {
                "intro": "Chapitres majeures:",
                "list": [
                    "Etude du SDK et des composants de la plateforme de développement.",
                    "Etude des composants principaux: Activité et service, Intent et broadcast receiver, Fragment, Persistence et Content Provider",
                    "Programmation d'applications sous forme de TP et ED",
                    "Déploiement d'application sur smartphone et tablette"
                ]
            }
        ],
        "credits": 4,
        "year": 2,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Pascal Bruegger"
        ],
        "id": 32,
        "moduleEn": "Information Systems and Mobile Applications",
        "courseEn": "Mobile Applications 1",
        "contentsEn": [
            {
                "list": [],
                "intro": "Through this course the student will become familiar with Android mobile concepts:"
            },
            {
                "list": [
                    "Study of the SDK and the components of the development platform.",
                    "Study of the main components: Activity and service, Intent and broadcast receiver, Fragment, Persistence and Content Provider",
                    "Programming of applications as TP and ED",
                    "Application deployment on smartphone and tablet"
                ],
                "intro": "Major chapters:"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Understand the basic concepts of programming on mobile devices across the 2 main platforms Android and IOS.",
                "Know the main components of the Android and IOS platforms",
                "Know how to develop applications on both platforms and deploy them on smartphones and tablets."
            ],
            "intro": "The main objectives of the course are:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-SIAM-I&courseId=B2C-PRC2-I",
        "module": "Systèmes d'Information et Applications Mobiles",
        "course": "Programmation concurrente 2",
        "grade": 5.1,
        "periods": 60,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Concevoir un programme distribué en identifiant, sur la base de critères objectifs, les différents processus et leur interaction.",
                "Utiliser à bon escient les outils de synchronisation et de communication entre processus.",
                "Mettre en oeuvre, dans différents environnements de programmation, les modèles de communication usuels.",
                "Représenter une application concurrente à l'aide d'un formalisme adéquat.",
                "Simuler à l'aide d'un formalisme adéquat le comportement dynamique d'un programme concurrent.",
                "Distribuer une application sur un réseau d'ordinateurs.",
                "Paralléliser un algorithme et l'implémenter."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Introduction: première approche, définitions, caractéristiques et modèle.",
                    "Communication: problématique, réalisation (messages asynchrones et synchrones, rendez-vous, RPC et RMI)",
                    "Langages/environnements de développement qui supportent la programmation distribuée: JR, Java, etc",
                    "Programmation distribuée.",
                    "Programmation parallèle."
                ]
            }
        ],
        "credits": 4,
        "year": 2,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "François Kilchoer"
        ],
        "id": 33,
        "moduleEn": "Information Systems and Mobile Applications",
        "courseEn": "Concurrent Programming 2",
        "contentsEn": [
            {
                "list": [
                    "Introduction: first approach, definitions, characteristics and model.",
                    "Communication: issues, implementation (asynchronous and synchronous messages, appointments, CPR and RMI)",
                    "Development languages/environments that support distributed programming: JR, Java, etc.",
                    "Distributed programming.",
                    "Parallel programming."
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Design a distributed program by identifying, based on objective criteria, the different processes and their interaction.",
                "Make good use of synchronization and communication tools between processes.",
                "To implement, in different programming environments, the usual communication models.",
                "Represent a competing application using appropriate formalism.",
                "To simulate the dynamic behaviour of a competing program using an appropriate formalism.",
                "Distribute an application over a computer network.",
                "Parallelize an algorithm and implement it."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-SIAM-I&courseId=B2C-DENG-I",
        "module": "Systèmes d'Information et Applications Mobiles",
        "course": "Systèmes d'information 1",
        "grade": 5,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Modéliser, structurer et représenter l'information en XML",
                "Transformer, manipuler et fusionner les structures et les modèles XML pour l'échange de l'information entre applications",
                "Formater et restituer l'information décrite en XML pour une publication orientée utilisateur sur des supports fixes et mobiles",
                "Développer des applications utilisant des parseurs syntaxiques (arborescents, événementiels) et des modèles objets en vigueur pour le traitement et le stockage des données XML",
                "Déterminer les enjeux des nouvelles technologies, l'importance de la standardisation dans le processus d'échanges des données et dans la chaine éditoriale de l'entreprise"
            ]
        },
        "contents": [
            {
                "intro": "Document modeling & representing",
                "list": [
                    "Document Model",
                    "XML Language (syntax, tag)",
                    "DTD (Document Type Definition)",
                    "XML Schema - basic concepts"
                ]
            },
            {
                "intro": "Document Transforming",
                "list": [
                    "XPATH Language",
                    "XSLT Language"
                ]
            },
            {
                "intro": "Document Rendering",
                "list": [
                    "CSS (Cascading Style Sheet)",
                    "XSL-FO (Formating Object) Language",
                    "SVG (Scalable Vector Graphics), SMIL (Synchronized Multimedia Integration Language), etc."
                ]
            },
            {
                "intro": "Document Programming",
                "list": [
                    "DOM (Document Object Model) standard",
                    "SAX (Simple API for XML) standard",
                    "JDOM (Java API for DOM), JAXP (Java API for XML Processing)"
                ]
            }
        ],
        "credits": 2,
        "year": 2,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: TP/évaluation de rapports, ecrit et/ou oral"
        ],
        "teachers": [
            "Elena Mugellini"
        ],
        "id": 34,
        "moduleEn": "Information Systems and Mobile Applications",
        "courseEn": "Information Systems 1",
        "contentsEn": [
            {
                "list": [
                    "Document Model",
                    "XML Language (syntax, tag)",
                    "DTD (Document Type Definition)",
                    "XML Schema - basic concepts"
                ],
                "intro": "Document modeling & representing"
            },
            {
                "list": [
                    "XPATH Language",
                    "XSLT Language"
                ],
                "intro": "Transforming Document"
            },
            {
                "list": [
                    "CSS (Cascading Style Sheet)",
                    "XSL-FO (Formating Object) Language",
                    "SVG (Scalable Vector Graphics), SMIL (Synchronized Multimedia Integration Language), etc."
                ],
                "intro": "Document Rendering"
            },
            {
                "list": [
                    "DOM (Document Object Model) standard",
                    "SAX (Simple API for XML) standard",
                    "JDOM (Java API for DOM), JAXP (Java API for XML Processing)"
                ],
                "intro": "Programming Document"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: TP/evaluation of reports, written and/or oral"
        ],
        "objectivesEn": {
            "list": [
                "Model, structure and represent information in XML",
                "Transform, manipulate and merge XML structures and models for the exchange of information between applications",
                "Formatting and rendering the information described in XML for user-oriented publishing on fixed and mobile media",
                "Develop applications using syntax parsers (tree, event) and current object models for processing and storing XML data.",
                "Determine the stakes of new technologies, the importance of standardization in the process of data exchange and in the editorial chain of the company."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-MPOS-I&courseId=B2C-SYEX-I",
        "module": "Systèmes embarqués et systèmes d'exploitation",
        "course": "Système d'exploitation 1",
        "grade": 5.1,
        "periods": 40,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait",
            "list": [
                "Expliquer les mécanismes mis en oeuvre dans un système d'exploitation multi-tâches et multi-utilisateurs.",
                "Expliquer les mécanismes de gestion, partage, et de protection des ressources communes des systèmes d'exploitation usuels.",
                "Configurer l'environnement utilisateur d'un système d'exploitation.",
                "Installer et configurer une application d'un système d'exploitation.",
                "Programmer l'interpréteur de commande (shell) d'un système d'exploitation.",
                "Utiliser les outils de programmation disponibles du système d'exploitation (pipes, filtres, éditeurs, compilateurs, debuggers, make, source-code control)."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Mémoire, organisation et gestion: mémoire principale, mémoire virtuelle, algorithmes de gestion.",
                    "Algorithmes d'ordonnancement - mécanismes de base et exemples",
                    "Disque, organisation et gestion: optimisation des performances, systèmes de gestion des fichiers, exemples Unix/NT, sécurité, protection et sauvegarde.",
                    "Entrées-sorties: mécanismes de base, exemples Unix/NT.",
                    "Outils informatiques/programmation shell: sh et variantes principales; commandes usuels (coreutils) + quelques outils pour experts (grep, sed, awk, python)."
                ]
            }
        ],
        "credits": 3,
        "year": 2,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "François Kilchoer"
        ],
        "id": 35,
        "moduleEn": "Embedded systems and operating systems",
        "courseEn": "Operating Systems 1",
        "contentsEn": [
            {
                "list": [
                    "Memory, organization and management: main memory, virtual memory, management algorithms.",
                    "Scheduling algorithms - basic mechanisms and examples",
                    "Disk, organization and management: performance optimization, file management systems, Unix/NT examples, security, protection and backup.",
                    "Input-output: basic mechanisms, Unix/NT examples.",
                    "Computer tools/shell programming: sh and main variants; common commands (coreutils) + some tools for experts (grep, sed, awk, python)."
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Explain the mechanisms implemented in a multi-tasking and multi-user operating system.",
                "Explain the mechanisms for managing, sharing, and protecting common resources in common operating systems.",
                "Configure the user environment of an operating system.",
                "Install and configure an operating system application.",
                "Programming the shell of an operating system.",
                "Use the available programming tools of the operating system (pipes, filters, editors, compilers, debuggers, make, source-code control)."
            ],
            "intro": "At the end of the course, the student knows"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-MPOS-I&courseId=B2C-SEM1-IT",
        "module": "Systèmes embarqués et systèmes d'exploitation",
        "course": "Embedded-Systems 1",
        "grade": 5.1,
        "periods": 64,
        "objectives": {
            "intro": "De façon globale le cours de Systèmes Embarqués 1 vise les objectifs suivants:",
            "list": [
                "Concevoir et programmer des traitements séquentiels en langage C",
                "Concevoir et programmer des traitements séquentiels en langage assembleur ARM",
                "Mettre en oeuvre des systèmes à microprocesseurs",
                "d'utiliser des outils de développement croisé pour des systèmes embarqués",
                "de décomposer l'exécution d'une instruction assembleur",
                "de programmer des structures de traitement en assembleur",
                "de programmer des fonctions en langage C en manipulant les éléments de base du langage et en gérant les allocations dynamique de la mémoire",
                "de programmer le traitement de périphériques par scrutation en C",
                "de programmer en orienté-objet en langage C"
            ]
        },
        "contents": [
            {
                "intro": "Le cours traitera des sujets suivants:",
                "list": [
                    "Le langage C et son utilisation (types et déclarations de base, types complexes, fonctions, pointeurs et pointeurs de fonctions)",
                    "La programmation orienté-objet en langage C",
                    "Outils de développement (génération, validation, documentation)",
                    "Jeu d'instructions du microprocesseur ARM (assembleur)",
                    "Les modes d'adressage du microprocesseur ARM",
                    "Interfaçage assembleur - C",
                    "Traitement des nombres entiers et en virgule flottante",
                    "Mise en oeuvre de périphériques simples"
                ]
            }
        ],
        "credits": 4,
        "year": 2,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Jacques Supcik"
        ],
        "id": 36,
        "moduleEn": "Embedded systems and operating systems",
        "courseEn": "Embedded-Systems 1",
        "contentsEn": [
            {
                "list": [
                    "The C language and its use (basic types and declarations, complex types, functions, pointers and function pointers)",
                    "Object-oriented programming in C",
                    "Development tools (generation, validation, documentation)",
                    "ARM microprocessor instruction set (assembler)",
                    "ARM microprocessor addressing modes",
                    "Assembler Interface - C",
                    "Floating point and integer processing",
                    "Implementation of simple peripherals"
                ],
                "intro": "The course will cover the following topics:"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Designing and programming sequential processing in C language",
                "Designing and programming sequential processing in ARM assembly language",
                "Implementing microprocessor systems",
                "to use cross-development tools for embedded systems",
                "to decompose the execution of an assembler instruction",
                "to program processing structures in assembler",
                "to program functions in C language by manipulating the basic elements of the language and managing dynamic memory allocations",
                "to program the processing of peripherals by scanning in C",
                "object-oriented programming in C language"
            ],
            "intro": "Overall, the Embedded Systems 1 course has the following objectives:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B2M-MPOS-I&courseId=B2C-SEM2-I",
        "module": "Systèmes embarqués et systèmes d'exploitation",
        "course": "Systèmes Embarqués 2",
        "grade": 5,
        "periods": 64,
        "objectives": {
            "intro": "De façon globale le cours de systèmes embarqués 2 vise les objectifs suivants:",
            "list": [
                "Décrire et expliquer les architectures générales des microprocesseurs",
                "Concevoir et programmer des traitements interruptifs en langages assembleur et C",
                "Interfacer au niveau logiciel un microprocesseur avec différents périphériques",
                "Décrire et expliquer les notions de DMA, mémoire cache, mémoire virtuelle (MMU), pipelining",
                "de décrire l'architecture générale des microprocesseurs",
                "de décrire l'architecture interne des microprocesseurs",
                "de traiter les interruptions et les exceptions",
                "d'interfacer un périphérique à un microprocesseur en mode interruptif et d'en programmer les fonctions de base",
                "de programmer les éléments de base du noyau d'un système d'exploitation",
                "de concevoir et programmer un pilote logiciel simple",
                "d'interfacer et/ou de configurer un mécanisme d'accès de mémoire direct (DMA) entre un périphérique et un microprocesseur",
                "de décrire et de configurer le contrôleur de la mémoire cache et de l'unité de gestion de la mémoire (MMU)"
            ]
        },
        "contents": [
            {
                "intro": "Le cours traitera des sujets suivants:",
                "list": [
                    "Architecture générale des microprocesseurs (Von Neuman, Harvard, SIMD, MIMD)",
                    "Architecture interne des microprocesseurs",
                    "Programmation interruptive",
                    "Interconnection de périphériques usuels",
                    "Eléments du noyau d'un système d'exploitation (thread, sémaphore, etc.)",
                    "Direct Access Memory (DMA)",
                    "Mémoires caches",
                    "Memory Management Unit (MMU)"
                ]
            }
        ],
        "credits": 4,
        "year": 2,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports",
            "Examen: oral (15 min.)"
        ],
        "teachers": [
            "Jacques Supcik"
        ],
        "id": 37,
        "moduleEn": "Embedded systems and operating systems",
        "courseEn": "Embedded-Systems 2",
        "contentsEn": [
            {
                "list": [
                    "General microprocessor architecture (Von Neuman, Harvard, SIMD, MIMD)",
                    "Internal microprocessor architecture",
                    "Programmation interruptive",
                    "Interconnection of common peripherals",
                    "Operating system kernel elements (thread, semaphore, etc.)",
                    "Direct Access Memory (DMA)",
                    "Hidden memories",
                    "Memory Management Unit (MMU)"
                ],
                "intro": "The course will cover the following topics:"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports",
            "Exam: oral (15 min.)"
        ],
        "objectivesEn": {
            "list": [
                "Describe and explain the general architectures of microprocessors",
                "Designing and programming interrupt processing in assembler and C languages",
                "Interfacing a microprocessor with various peripherals at the software level",
                "Describe and explain the concepts of DMA, cache memory, virtual memory (MMU), pipelining, etc.",
                "describe the general architecture of microprocessors",
                "describe the internal architecture of the microprocessors",
                "handle interruptions and exceptions",
                "to interface a peripheral device to a microprocessor in interrupt mode and to program its basic functions",
                "to program the basic elements of the kernel of an operating system",
                "design and program a simple software driver",
                "interfacing and/or configuring a direct memory access (DMA) mechanism between a device and a microprocessor",
                "describe and configure the cache and memory management unit (MMU) controller"
            ],
            "intro": "Overall, the Embedded Systems 2 course has the following objectives:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-ITAP-I&courseId=B3C-SIPH-I",
        "module": "Informatique appliquée",
        "course": "Physique et simulation",
        "grade": 5.4,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant saura:",
            "list": [
                "modéliser mathématiquement quelques problèmes de la mécanique en synthétisant ses connaissances de la physique et des mathématiques,",
                "résoudre ces problèmes par un algorithme numérique approprié,",
                "plusieurs moyens de validation des résultats obtenus,",
                "évaluer les forces et les faiblesses des différents modèles et algorithmes de résolution"
            ]
        },
        "contents": [
            {
                "intro": "Physique: rappel sur les concepts nécessaires pour la modélisation/simulation de la mécanique des corps rigides et déformables:",
                "list": [
                    "cinématique",
                    "quantité de mouvement, bilan des forces, conservation d'énergie",
                    "frottement, contact",
                    "système masse-ressort, oscillateur harmonique, équation d'ondes",
                    "barycentre, loi d'Archimède"
                ]
            },
            {
                "intro": "Mathématiques: traitement numérique des équations différentielles ordinaires:",
                "list": [
                    "schémas numériques explicites, implicites et symplectiques pour le problème de Cauchy et leurs propriétés (stabilité, précision, conservation d'énérgie, ...)",
                    "méthode des différences finies",
                    "résolution itérative des systèmes linéaires et non-linéaires"
                ]
            }
        ],
        "credits": 3,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Ales Janka"
        ],
        "id": 38,
        "moduleEn": "Applied Computer Science 1",
        "courseEn": "Physics and Simulation",
        "contentsEn": [
            {
                "list": [
                    "kinematics",
                    "amount of motion, force balance, energy conservation",
                    "friction, contact",
                    "mass-spring system, harmonic oscillator, wave equation",
                    "barycentre, Archimedes' law"
                ],
                "intro": "Physics: a reminder of the concepts necessary for the modeling/simulation of the mechanics of rigid and deformable bodies:"
            },
            {
                "list": [
                    "explicit, implicit and symplectic numerical schemes for the Cauchy problem and their properties (stability, precision, energy conservation, ...)",
                    "finite difference method",
                    "iterative resolution of linear and non-linear systems"
                ],
                "intro": "Mathematics: numerical processing of ordinary differential equations:"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "model mathematically some problems of mechanics by synthesizing his knowledge of physics and mathematics,",
                "solve these problems with an appropriate numerical algorithm,",
                "several means of validating the results obtained,",
                "evaluate the strengths and weaknesses of different models and resolution algorithms"
            ],
            "intro": "At the end of the course, the student will know:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-ITAP-I&courseId=B3C-CPRG-I",
        "module": "Informatique appliquée",
        "course": "Programmation C/C++",
        "grade": 4.1,
        "periods": 68,
        "objectives": {
            "intro": "A la fin du cours l'étudiant sait:",
            "list": [
                "Utiliser les langages de programmation C et C++ de façon professionnelle."
            ]
        },
        "contents": [
            {
                "intro": "Programmation avancée en C/C++ (32 périodes):",
                "list": [
                    "Java et C++ : quelles différences",
                    "Les spécificités de C",
                    "La gestion de la mémoire: les pointeurs, ...",
                    "Structures de données: Unions, structures, etc..",
                    "Les classes en C++.",
                    "Les méthodes et le passage de paramètres",
                    "Les opérateurs",
                    "Les classes ''Templates''",
                    "L'héritage multiple",
                    "La compilation: Pré-processeur, portabilité , compilation conditionnelle, ...",
                    "Outils de développement"
                ]
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits"
        ],
        "teachers": [
            "François Kilchoer"
        ],
        "id": 39,
        "moduleEn": "Applied Computer Science 1",
        "courseEn": "C/C++ Programming",
        "contentsEn": [
            {
                "list": [
                    "Java and C++: what differences",
                    "The specificities of C",
                    "Memory management: pointers, ...",
                    "Data structures: Unions, structures, etc...",
                    "Classes in C++.",
                    "Methods and parameter passing",
                    "The operators",
                    "Les classes ''Templates''",
                    "Multiple inheritance",
                    "Compilation: Pre-processor, portability, conditional compilation, ...",
                    "Development Tools"
                ],
                "intro": "Advanced programming in C/C++ (32 periods):"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work"
        ],
        "objectivesEn": {
            "list": [
                "Use C and C++ programming languages professionally."
            ],
            "intro": "At the end of the course the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-ITAP-I&courseId=B3C-MPRO-I",
        "module": "Informatique appliquée",
        "course": "Microprocesseurs",
        "grade": 3.8,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait",
            "list": [
                "Expliquer l'architecture interne de différents processeurs.",
                "les techniques de programmation pour utiliser efficacement les mémoires caches et le pipelining.",
                "Utiliser l'outil Valgrind pour contrôler, optimiser un programme",
                "les bases des processeurs Intel pour faire du reverse-engineering",
                "utiliser les instructions SIMD des processeurs Intel pour paralléliser et optimiser des opérations mathématiques",
                "les principes utilisés dans les GPU"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "InstructionSet des processeurs. Options de gcc relatives à l'instructionSet",
                    "Organisation de la mémoire cache. Programmation en C afin d'utiliser de manière optimale la mémoire cache",
                    "Organisation du pipelining. Programmation en C afin d'utiliser de manière optimale le pipelining",
                    "Utilisation de Valgrind pour contrôler-optimiser un programme.",
                    "Architectures des processeurs Intel",
                    "Reverse Engineering d'un executable",
                    "Base de la programmation des GPU"
                ]
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits"
        ],
        "teachers": [
            "Jean-Roland Schuler"
        ],
        "id": 40,
        "moduleEn": "Applied Computer Science 1",
        "courseEn": "Microprocessor Systems",
        "contentsEn": [
            {
                "list": [
                    "InstructionSet of processors. gcc options related to theSet statement",
                    "Organization of the cache memory. Programming in C to make optimal use of the cache memory",
                    "Organization of pipelining. Programming in C for optimal use of pipelining",
                    "Use of Valgrind to control-optimize a program.",
                    "Intel processor architectures",
                    "Reverse Engineering d'un executable",
                    "Basics of GPU programming"
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work"
        ],
        "objectivesEn": {
            "list": [
                "Explain the internal architecture of different processors.",
                "programming techniques to make effective use of caches and pipelining.",
                "Using the Valgrind tool to control, optimize a program",
                "the basics of Intel processors for reverse-engineering",
                "use the SIMD instructions of Intel processors to parallelise and optimise mathematical operations",
                "the principles used in GPUs"
            ],
            "intro": "At the end of the course, the student knows"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-ITAP-I&courseId=B3C-SECA-I",
        "module": "Informatique appliquée",
        "course": "Sécurité des applications",
        "grade": 4.6,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant-e ...",
            "list": [
                "connait les principes de sécurité et le contexte de la sécurité des applications Web",
                "connait les sources d'informations disponibles (institutions, bases de données, listes Top10, etc.)",
                "comprend les vulnérabilités les plus fréquentes et/ou dangereuses et connait les mesures de prévention appropriées",
                "comprend les mécanismes de sécurité dans les navigateurs Web",
                "sait intégrer les aspects de sécurité dans le cycle de développement (p.ex. la modélisation des menaces)",
                "a acquis des compétences fondamentales pour l'exploitation de vulnérabilités (' ethical hacking ')"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Institutions et leurs activités (p.ex. OWASP, WASC, SANS, MITRE)",
                    "Liste de failles (p.ex. OWASP Top10, SANS Top25)",
                    "Base données des vulnérabilités (p.ex. CVE, CWE)",
                    "Méthodes et métriques pour l'évaluation de risques des vulnérabilités",
                    "Intégration de la sécurité dans le cycle de développement (p.ex. Threat Modeling)",
                    "Étude et traitement des failles les plus fréquentes / dangereuses (OWASP Top10)"
                ]
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Rudolf Scheurer"
        ],
        "id": 41,
        "moduleEn": "Applied Computer Science 1",
        "courseEn": "Web Application Security",
        "contentsEn": [
            {
                "list": [
                    "Institutions and their activities (e.g. OWASP, WASC, SANS, MITRE)",
                    "Fault list (e.g. OWASP Top10, WITHOUT Top25)",
                    "Vulnerability database (e.g. CVE, CWE)",
                    "Methods and metrics for risk assessment of vulnerabilities",
                    "Integration of security in the development cycle (e.g. Threat Modeling)",
                    "Study and treatment of the most frequent / dangerous faults (OWASP Top10)"
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "is familiar with security principles and the context of web application security",
                "knows the sources of information available (institutions, databases, Top10 lists, etc.)",
                "understands the most common and/or dangerous vulnerabilities and knows the appropriate prevention measures",
                "understands the security mechanisms in Web browsers",
                "is able to integrate security aspects into the development cycle (e.g. threat modeling)",
                "has acquired basic skills for exploiting vulnerabilities (' ethical hacking ' )"
            ],
            "intro": "At the end of the course, the student..."
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-INFA-I&courseId=B3C-NSQL-I",
        "module": "Informatique avancée",
        "course": "Chapitre spécialisé: Introduction au monde NoSQL",
        "grade": 5.1,
        "periods": 30,
        "objectives": {
            "intro": "Ce cours est une introduction au monde des bases de données dites NoSQL. A la fin de ce chapitre choisi l'étudiant:",
            "list": [
                "Connait la classification des SGBDs dits NoSQL",
                "connait les cas d'usages typiques pour l'utilisation de ces technologies",
                "est capable d'expliquer les différents systèmes",
                "a exercé à travers ce chapitre choisis ces technologies."
            ]
        },
        "contents": [
            {
                "intro": "Depuis une dizaine d'année le mouvement des NoSQL et bigdata a pris de plus en plus d'ampleur. Présenté au début comme l'alternative magique aux immuables SGBDRs, la tendance actuelle modère ces paroles pour insister sur la complémentaritéde toutes ces technologies entre elles. L'avenir, au niveau du stokage des données, se présente donc sous forme de ''persistance polyglotte''.Pour les concepteurs et développeurs des nouveaux systèmes d'information, il s'agit donc d'être capable de monter une architecture mixant toutes ces technologies à bon escient. Pour ce faire, ce chapitre choisi propose de comprendre ce que sont ces technologies dites NoSQL, d'en voir lesavantages et désavantages afin d'en permettre une utilisation judicieuse. Y seront abordés les notions suivantes:",
                "list": [
                    "Scale-out vs scale-in et propriétés BASE vs ACID",
                    "Stockage distribué et calcul distribué (HDFS, Map Reduce, TEZ, Spark...)",
                    "Les entrepôts clé-valeur avec comme outil de démonstration: Redis",
                    "Les bases orientées documents avec comme outil de démonstration: MongoDB",
                    "Les bases de données orientées colonnes avec comme outil de démonstration: Cassandra",
                    "Les bases de données orientées graphe avec comme outil de démonstration: Neo4j"
                ]
            },
            {
                "intro": "Ce cours sera donné par Houda Chabbi Drissi (HEIAFR) et Benoit Perroud (Verisign)",
                "list": []
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Houda Chabbi",
            "Benoit Perroud"
        ],
        "id": 42,
        "moduleEn": "Advanced Computer Science",
        "courseEn": "Elective: NoSQL",
        "contentsEn": [
            {
                "list": [
                    "Scale-out vs. scale-in and BASE vs. ACID properties",
                    "Distributed storage and distributed computing (HDFS, Map Reduce, TEZ, Spark...)",
                    "Key-value warehouses with the following demo tool: Redis",
                    "The document-oriented databases with as demonstration tool: MongoDB",
                    "Column oriented databases with Cassandra as demonstration tool",
                    "Graph oriented databases with Neo4j as a demonstration tool."
                ],
                "intro": "Since about ten years the NoSQL and bigdata movement has been growing more and more. Initially presented as the magical alternative to the immutable RDBMSs, the current trend is moderating these words to insist on the complementarity of all these technologies with each other. The future, in terms of data storage, will therefore take the form of \"polyglot persistence\". For designers and developers of new information systems, it is therefore a question of being able to set up an architecture that mixes all these technologies to good effect. To do this, this chapter proposes to understand what these technologies known as NoSQL are, to see their advantages and disadvantages in order to allow a judicious use of them. The following concepts will be discussed:"
            },
            {
                "list": [],
                "intro": "This course will be given by Houda Chabbi Drissi (HEIAFR) and Benoit Perroud (Verisign)."
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Knows the classification of NoSQL DBMSs",
                "knows the typical use cases for the use of these technologies",
                "is able to explain the different systems",
                "has exercised through this chapter selected these technologies."
            ],
            "intro": "This course is an introduction to the world of NoSQL databases. At the end of this chapter choose the student:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-INFA-I&courseId=B3C-GDD3-I",
        "module": "Informatique avancée",
        "course": "Chapitre spécialisé: Game Design and Development",
        "grade": 5.5,
        "periods": 32,
        "objectives": {
            "intro": "Le jeu aide l'homme à développer naturellement son intelligence, ses habilités de coordination, ses compétences sociales et ainsi de suite. Pour cette raison, le jeu a toujours constitué une activité cruciale dans la vie de l'homme et, avec la révolution technologique, cela est devenu encore plus important : actuellement le nombre d'heures par semaine passées en jouant aux jeux-vidéo dépasse les 3 milliards. Pour cette raison, les jeux-vidéo sont désormais réputés parmi les formes plus importantes de media et art avec un marché global qui a dépassé les 81 milliards de dollars seulement en 2014. Entrer dans ce monde est non seulement une possibilité unique pour les professionnels en informatique du futur, mais aussi une opportunité de croissance personnelle car le game design développe aussi des compétences artistiques, en sociologie, en psychologie et en design général. En plus, réaliser un jeu-vidéo et demande des connaissances théoriques et technologiques particulières et extrêmement avancées. Ce cours vise donc à former les compétences de base nécessaires pour le design et développement de jeux-vidéo.",
            "list": [
                "Possèdera une connaissance des tous les éléments qui constituent le design d'un jeu.",
                "Sera capable de générer de façon autonome le design d'un jeu complet (applicable à tous les types de jeux, pas seulement jeux-vidéo).",
                "Saura développer un jeu-vidéo en utilisant Unity (une des plateformes les plus populaires et utilisées pour la création de jeux-vidéo).",
                "Aura une vision d'ensemble de la situation des jeux-vidéo dans la société contemporaine, avec des notions fondamentales pour l'application de ces concepts dans les pratiques très actuelles de ' Gamification ' et de ' Serious Game '.",
                "Connaitra les aspects ' business ' liés à l'entreprenariat moderne avec les démarches plus communes pour la création d'une start-up et sera au courant des autres possibilités de carrière dans le monde des jeux-vidéo.",
                "Renforcera ses capacités de planification d'un projet et de travail en équipe. La négociation avec ses partenaires et le pitch de son projet seront également entraînés."
            ]
        },
        "contents": [
            {
                "intro": "Le cours comprend une partie théorique et une partie pratique (travail dirigé avec un tutorial pour apprendre à utiliser Unity et pour réaliser un prototype de jeux-vidéo).La partie théorique comprend :",
                "list": [
                    "Introduction au design de jeux-vidéo : présentation et explication des méthodes de design, de collaboration dans une équipe multidisciplinaire et d'interaction avec les utilisateurs finaux.",
                    "Présentation et explications des éléments formels, avec focus sur les ' game mechanics ' (par exemple, les règles de jeu, la définition des actions, la manière de gérer l'expérience utilisateur, etc.) et leur équilibrage, sur la structure des interfaces et sur les modalités d'interaction.",
                    "Présentation des éléments dramatiques comme l'histoire, les scenarios, les personnages et les styles graphiques.",
                    "Introduction aux pratiques de ' Gamification ' et de ' Serious Game '.",
                    "Introduction à la création d'une entreprise, aux modèles commerciaux de l'industrie, et à la recherche de fonds. Présentation des possibilités de carrière dans le domaine."
                ]
            },
            {
                "intro": "L'enseignement pratique sera divisé en deux parties : un tutorial sur le fonctionnement de Unity et un projet accompli par groupes de 2 ou 3 étudiants. Le projet consistera à imaginer, à concevoir le design et à développer un jeu-vidéo sans contraintes de technologies à utiliser (les étudiants auront à disposition plusieurs périphériques à utiliser pour le développement de l'interface du jeu-vidéo, par exemple : Microsoft Kinect, Wii remote controller, Oculus Rift et cetera).",
                "list": []
            },
            {
                "intro": "Ce cours sera donnée par : Maurizio Caon, Maurizio Rigamonti & Omar Abou Khaled",
                "list": []
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Maurizio Rigamonti",
            "Maurizio Caon"
        ],
        "id": 43,
        "moduleEn": "Advanced Computer Science",
        "courseEn": "Elective: Game Design and Development",
        "contentsEn": [
            {
                "list": [
                    "Introduction to video game design: presentation and explanation of design methods, collaboration in a multidisciplinary team and interaction with end users.",
                    "Presentation and explanations of formal elements, with focus on game mechanics (e.g. game rules, definition of actions, how to manage the user experience, etc.) and their balancing, interface structure and interaction modalities.",
                    "Presentation of dramatic elements such as story, scenarios, characters and graphic styles.",
                    "Introduction to 'Gamification' and 'Serious Game' practices.",
                    "Introduction to starting a business, industry business models, and fundraising. Presentation of career opportunities in the field."
                ],
                "intro": "The course consists of a theoretical part and a practical part (directed work with a tutorial to learn how to use Unity and to make a video game prototype) The theoretical part includes :"
            },
            {
                "list": [],
                "intro": "The practical teaching will be divided into two parts: a tutorial on how Unity works and a project done by groups of 2 or 3 students. The project will consist in imagining, designing and developing a video game without constraints of the technologies to be used (students will have at their disposal several peripherals to be used for the development of the interface of the video game, for example: Microsoft Kinect, Wii remote controller, Oculus Rift et cetera)."
            },
            {
                "list": [],
                "intro": "This course will be given by : Maurizio Caon, Maurizio Rigamonti & Omar Abou Khaled"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Possesses knowledge of all the elements that make up the design of a game.",
                "Will be able to generate autonomously the design of a complete game (applicable to all types of games, not only video games).",
                "Will know how to develop a video game using Unity (one of the most popular platforms used for the creation of video games).",
                "Will have an overall vision of the situation of video games in contemporary society, with fundamental notions for the application of these concepts in the very current practices of 'Gamification' and 'Serious Game'.",
                "Will be familiar with the business aspects of modern entrepreneurship with the more common approaches to creating a start-up and will be aware of other career opportunities in the world of video games.",
                "Strengthen his or her project planning and teamwork skills. Negotiation with partners and pitching his project will also be trained."
            ],
            "intro": "Playing helps man to naturally develop his intelligence, coordination skills, social skills and so on. For this reason, gaming has always been a crucial activity in human life and, with the technological revolution, this has become even more important: currently the number of hours per week spent playing video games exceeds 3 billion. For this reason, video games are now reputed among the most important forms of media and art with a global market that will exceed $81 billion in 2014 alone. Entering this world is not only a unique opportunity for the IT professionals of the future, but also an opportunity for personal growth as game design also develops artistic skills, sociology, psychology and general design. In addition, making a video game requires special and extremely advanced theoretical and technological knowledge. This course aims to train the basic skills necessary for the design and development of video games."
        }
    },
    {
        "module": "Informatique avancée",
        "course": "Chapitre spécialisé: IT startup bootcamp",
        "grade": 5.5,
        "objectives": {
            "intro": "À la fin de ce cours l'étudiant est capable de:",
            "list": [
                "Comprendre le processus entrepreneurial, les méthodes utilisées pour l’identification des occasions d’affaires",
                "Apprécier l’importance de l’innovation dans le processus entrepreneurial",
                "Amorcer le processus d’une nouvelle idée et organiser les ressources afin de lancer des projets ou des entreprises",
                "Comprendre les briques de base d’un business plan",
                "Présenter oralement un business plan simple à des partenaires et investisseurs potentiels",
                "Initier la recherche de financement pour l’entreprise"
            ]
        },
        "contents": [
            {
                "list": [
                    "Innova&on et entreprenariat / Développer une opportunité (idéation, pitch, etc.)",
                    "Business concept & modèles en IT / Business model canvas / Lean canvas",
                    "Lean startup development / Minimum Viable Products / IT product roadmap",
                    "Ecosystème start-up incluant coaching, funding, etc.",
                    "Eléments de propriétés intellectuelles dans un contexte startup IT",
                    "Équipe (créer son équipe, etc.) / opportunité du marché (go-to-market)",
                    "Finances (grands lignes) / Approches de financement des startups : crowdfunding- angels-VC, valorisation, NPV"
                ]
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Omar Abou Khaled",
            "Jean Hennebert"
        ],
        "id": 44,
        "moduleEn": "Advanced Computer Science",
        "courseEn": "Elective: IT startup bootcamp",
        "contentsEn": [
            {
                "list": [
                    "Innova&on and entrepreneurship / Developing an opportunity (ideation, pitch, etc.)",
                    "Business concept & models in IT / Business model canvas / Lean canvas",
                    "Lean startup development / Minimum Viable Products / IT product roadmap",
                    "Ecosystème start-up incluant coaching, funding, etc.",
                    "Intellectual property elements in an IT startup context",
                    "Team (building your team, etc.) / market opportunity (go-to-market)",
                    "Finance (broad lines) / Approaches to financing start-ups: crowdfunding- angels-VC, valuation, NPV"
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Understand the entrepreneurial process, the methods used to identify business opportunities",
                "Appreciating the importance of innovation in the entrepreneurial process",
                "Initiating the process of a new idea and organizing resources to launch projects or businesses",
                "Understand the basic building blocks of a business plan",
                "Present a simple business plan orally to potential partners and investors",
                "Initiate the search for financing for the company"
            ],
            "intro": "At the end of this course the student is able to:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-INFA-I&courseId=B3C-MALE-I",
        "module": "Informatique avancée",
        "course": "Chapitre spécialisé: Machine Learning Applications",
        "grade": 4.9,
        "periods": 24,
        "objectives": {
            "intro": "Machine Learning Applications and Frameworks",
            "list": [
                "identifier les cas d'utilisation de techniques de machine learning",
                "comprendre les concepts d'apprentissage à partir des données, d'apprentissage supervisé vs non supervisé, de présentation d'hypothèses",
                "d'appliquer des méthodes machine learning pour des tâches de clustering, de classification, de prédiction",
                "de comprendre les principes de base d'algorithmes de machine learning, incluant les algorithmes de clustering (k-Means), les approches bayésiennes, les mixtures de gaussiennes, les Réseaux de Neurones Artificiels, les arbres de décisions, etc.",
                "d'utiliser des frameworks de data mining tels que Knime ou Weka sur des données concrètes"
            ]
        },
        "contents": [
            {
                "intro": "Introduction",
                "list": [
                    "Le Machine Learning est une branche de l'Intelligence Artificielle qui étudie des algorithmes dits à ''apprentissage automatique''. Ces algorithmes sont capables, à partir d'exemples, de résoudre des problèmes complexes qu'il serait difficile de résoudre en utilisant des approches traditionnelles. Le Machine Learning est aujourd'hui utilisé dans plusieurs domaines: prédiction (évolution de la bourse, météo), classification (reconnaissance de geste, reconnaissance de la parole, reconnaissance d'image), vérification/détection (authentification biométrique), data-mining (clustering sur données complexes)."
                ]
            },
            {
                "intro": "Méthode",
                "list": [
                    "Le cours combine des séances théoriques et des séances pratiques. Une importance particulière est donnée aux séances pratiques qui se feront via des exercices dirigés en classe (entre autre par l'utilisation de l'outil KNIME et WEKA) et via des mini-projets réalisés en groupe de 2-3 personnes."
                ]
            },
            {
                "intro": "Contenu -- Partie I - Principes de bases (20%) --",
                "list": [
                    "Définition des approches Machine Learning : concepts d'apprentissage à partir des données, d'apprentissage supervisé vs non supervisé, d'extraction de caractéristiques, de présentation d'hypothèses.",
                    "Définition des domaines d'utilisation à travers des exemples concrets : prédiction, classification, vérification, clustering."
                ]
            },
            {
                "intro": "Contenu -- Partie II - Algorithmes de Machine Learning: théorie et application (60%) --",
                "list": [
                    "Introduction au framework KNIME",
                    "Données brutes vers caractéristiques utiles: algorithmes de preprocessing et extraction de caractéristiques",
                    "Clustering",
                    "Règles d'association",
                    "Approches Bayesiennes",
                    "Arbres de décisions",
                    "Réseaux de neurones artificiels",
                    "Mixtures de gaussiennes"
                ]
            },
            {
                "intro": "Contenu -- Partie III - Applications avancées (20%) --",
                "list": [
                    "Traitement de signaux temporels",
                    "State-based modeling",
                    "Traitement de données hétérogènes, principes de fusion"
                ]
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Jean Hennebert",
            "Elena Mugellini"
        ],
        "id": 45,
        "moduleEn": "Advanced Computer Science",
        "courseEn": "Elective: Macine Learning",
        "contentsEn": [
            {
                "list": [
                    "Machine Learning is a branch of Artificial Intelligence that studies so-called \"machine learning\" algorithms. These algorithms are capable, using examples, of solving complex problems that would be difficult to solve using traditional approaches. Machine Learning is used today in several fields: prediction (stock market evolution, weather), classification (gesture recognition, speech recognition, image recognition), verification/detection (biometric authentication), data-mining (clustering on complex data)."
                ],
                "intro": "Introduction"
            },
            {
                "list": [
                    "The course combines theoretical and practical sessions. Particular importance is given to practical sessions, which will be done through guided classroom exercises (including the use of the KNIME and WEKA tools) and through mini-projects carried out in groups of 2-3 people."
                ],
                "intro": "Method"
            },
            {
                "list": [
                    "Definition of Machine Learning approaches: concepts of learning from data, supervised vs. unsupervised learning, feature extraction, hypothesis presentation.",
                    "Definition of fields of use through concrete examples: prediction, classification, verification, clustering."
                ],
                "intro": "Contents -- Part I - Basic principles (20%) --"
            },
            {
                "list": [
                    "Introduction au framework KNIME",
                    "Raw data to useful features: preprocessing algorithms and feature extraction",
                    "Clustering",
                    "Rules of association",
                    "Approches Bayesiennes",
                    "Decision trees",
                    "Artificial neural networks",
                    "Gaussian Mixtures"
                ],
                "intro": "Contents -- Part II - Machine learning algorithms: theory and application (60%) --"
            },
            {
                "list": [
                    "Time signal processing",
                    "State-based modeling",
                    "Heterogeneous data processing, merging principles"
                ],
                "intro": "Contents -- Part III - Advanced applications (20%) --"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "identify cases of use of machine learning techniques",
                "understand the concepts of learning from data, supervised vs. unsupervised learning, presenting hypotheses",
                "to apply machine learning methods for clustering, classification, prediction tasks",
                "understand the basic principles of machine learning algorithms, including clustering algorithms (k-Means), Bayesian approaches, Gaussian mixtures, Artificial Neuron Networks, decision trees, etc.",
                "to use data mining frameworks such as Knime or Weka on concrete data"
            ],
            "intro": "Machine Learning Applications and Frameworks"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-ITA2-I&courseId=B3C-SGBD-I",
        "module": "Informatique avancée 2",
        "course": "Bases de données 2",
        "grade": 4.6,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Etablir les choix transactionnels à mettre en oeuvre.",
                "Administrer une base de donnée (maîtrise de l'indexation, optimisation, normalisation/dénormalisation)",
                "Etablir la liste des composants qui lui sont nécessaires pour implémenter une politique de gestion de base de donnée(tuning, backups, logs...). Il aura la base théorique pour comprendre les approches adoptées par les éditeurs SGBDs."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Connaitre le SQL LMD avancé: fonctions de regroupement poussées / fenêtrage etc.",
                    "Dépendance fonctionnelle et normalisation",
                    "Organisation physique: (méthodes d'accès, indexation)",
                    "Gestion de la concurence: transaction, algorithme de vérouillage et d'estampillage les niveaux de sérialisation.",
                    "Résistance aux pannes et sécurité des données: sauvegrade, reprise journalisation...",
                    "Mécanisme d'optimisation de requêtes"
                ]
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits"
        ],
        "teachers": [
            "Houda Chabbi"
        ],
        "id": 46,
        "moduleEn": "Advanced Computer Science 2",
        "courseEn": "Databases 2",
        "contentsEn": [
            {
                "list": [
                    "Know advanced SQL LMD: advanced grouping functions / windowing etc.",
                    "Functional dependency and standardization",
                    "Physical organization: (access methods, indexing)",
                    "Concurrency management: transaction, locking algorithm and stamping serialization levels.",
                    "Fail-safe and data security: backup, logging recovery...",
                    "Query optimization mechanism"
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work"
        ],
        "objectivesEn": {
            "list": [
                "Establish the transactional choices to be implemented.",
                "Administering a database (control of indexing, optimization, normalization/denormalization)",
                "Establish the list of components that are necessary to implement a database management policy (tuning, backups, logs...). It will have the theoretical basis to understand the approaches adopted by DBMS editors."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-ITA2-I&courseId=B3C-GELO-I",
        "module": "Informatique avancée 2",
        "course": "Génie logiciel 2",
        "grade": 5,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours l'étudiant sait:",
            "list": [
                "Analyser, concevoir, réaliser des applications informatiques distribuées: Diagramme de composant et de déployement.",
                "Comprendre et appliquer les patrons de conception (design patterns)",
                "Analyser, concevoir, réaliser des applications informatiques 3-tiers."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Principes d'architecture OO: Diagrammes de composants et de déployement.",
                    "Principaux design patterns",
                    "Principes de l'architecture 3-tiers",
                    "Composants logiciels: Conception et mise en oeuvre d'un système client/serveur."
                ]
            }
        ],
        "credits": 3,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: TP/évaluation de rapports, épreuves orales ou écrites"
        ],
        "teachers": [
            "Pierre Kuonen"
        ],
        "id": 47,
        "moduleEn": "Advanced Computer Science 2",
        "courseEn": "Software Engineering 2",
        "contentsEn": [
            {
                "list": [
                    "OO architecture principles: Component and deployment diagrams.",
                    "Main design patterns",
                    "Principles of 3-tier architecture",
                    "Software components: Design and implementation of a client/server system."
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: TP/evaluation of reports, oral or written tests"
        ],
        "objectivesEn": {
            "list": [
                "Analyze, design, implement distributed computer applications: Component and deployment diagram.",
                "Understand and apply design patterns",
                "Analyze, design, realize 3-tier computer applications."
            ],
            "intro": "At the end of the course the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-ITA2-I&courseId=B3C-INHM-I",
        "module": "Informatique avancée 2",
        "course": "Interfaces homme-machine 2",
        "grade": 5.1,
        "periods": 24,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait",
            "list": [
                "Expliquer les composantes principales de l'UX (expérience utilisateur).",
                "Adopter une approche itérative et centrée sur l'utilisateur (UCD) pour concevoir des interfaces utilisateurs, des systèmes interactifs.",
                "Appliquer les critères ergonomiques dès la phase de conception.",
                "Expliquer les différentes phases du cycle développement de l'UX, les méthodes et techniques de chaque phase (e.g.: idéation, diagramme d'affinité, personas, développement de maquettes fil de fer ou 'wireframe', mockup).",
                "Appliquer les méthodes et techniques de chaque phase du cycle dans un projet de développement d'interface utilisateur proposé, basé sur des 'vrais' besoins.",
                "Expliquer les concepts fondamentaux du 'Material Design' (son rapport avec les critères ergonomiques, sa différence avec le design plat ou le 'flat design' pur).",
                "Expliquer les concepts fondamentaux du patron de conception d'interfaces FLUX (son lien avec d'autres variantes MVC et d'autres patrons de conception ou 'design patterns').",
                "Réaliser un prototype d'interface utilisateur avec la librairie REACT (basée sur FLUX) et une librairie CSS appliquant le 'Material Design'.",
                "Choisir le type d'évaluation d'interface adéquat selon la phase de développement du projet et son contexte.",
                "Réaliser des évaluations analytiques et/ou empiriques à chaque itération et étape du cycle de développement."
            ]
        },
        "contents": [
            {
                "intro": "Contenu principal (aspects techniques et aspects ergonomiques)",
                "list": [
                    "Principes et techniques de la conception de systèmes interactifs centrés sur utilisateur ('User-Centered Design').",
                    "Composantes principales de l'UX (expérience utilisateur): utilité, utilisabilité, et impact émotionnel.",
                    "Application des techniques classiques de l'ingénierie dans le cycle de développement d'interfaces utilisateurs et systèmes interactifs.",
                    "Méthodes et techniques spécifiques à chaque phase du cycle du développement (e.g. idéation, diagramme d'affinité, personas, maquette fil de fer ou 'wireframe', mockup interactif).",
                    "Principes et critères ergonomiques de développement d'interfaces 'utilisables'.",
                    "Introduction au 'Material Design' (son lien avec les critères ergonomiques, ses avantages par rapport au design plat ou 'Flat Design').",
                    "Introduction au patron de conception d'interfaces FLUX (spécificités, avantages, liens avec d'autres patrons de conception 'design patterns' et variantes MVC).",
                    "Introduction à la librairie REACT (basée sur FLUX et utilisée dans le développement d'interface ''front-end'' utilisateur).",
                    "Types d'évaluation des interfaces utilisateurs (sommative vs formative, empirique vs analytique, basée sur des données qualitatives vs quantitatives, rapides vs rigoureuses).",
                    "Questionnaires standards employés dans les évaluations empiriques.",
                    "Adaptation de l'évaluation à la phase de développement et au contexte du projet."
                ]
            },
            {
                "intro": "Contenu optionnel (en fonction des thématiques choisies et du temps à disposition)",
                "list": [
                    "Introduction à la librairie REDUX."
                ]
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Sandy Ingram"
        ],
        "id": 48,
        "moduleEn": "Advanced Computer Science 2",
        "courseEn": "Human-Computer Interaction 2",
        "contentsEn": [
            {
                "list": [
                    "Principles and techniques of User-Centered Design (UCD).",
                    "Main components of UX (user experience): utility, usability, and emotional impact.",
                    "Application of classical engineering techniques in the development cycle of user interfaces and interactive systems.",
                    "Methods and techniques specific to each phase of the development cycle (e.g. ideation, affinity diagram, personas, wireframe, interactive mockup).",
                    "Ergonomic principles and criteria for the development of 'usable' interfaces.",
                    "Introduction to 'Material Design' (its link with ergonomic criteria, its advantages over flat design).",
                    "Introduction to the FLUX interface design pattern (specificities, advantages, links with other design patterns and MVC variants).",
                    "Introduction to the REACT library (based on FLUX and used in the development of front-end user interfaces).",
                    "Types of user interface evaluation (summative vs. formative, empirical vs. analytical, based on qualitative vs. quantitative data, rapid vs. rigorous).",
                    "Standard questionnaires used in empirical evaluations.",
                    "Adaptation of the evaluation to the development phase and context of the project."
                ],
                "intro": "Main content (technical and ergonomic aspects)"
            },
            {
                "list": [
                    "Introduction to the REDUX bookstore."
                ],
                "intro": "Optional content (depending on the chosen themes and the time available)"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Explain the main components of UX (user experience).",
                "Adopt an iterative and user-centred approach (UCD) to design user interfaces, interactive systems.",
                "Apply ergonomic criteria right from the design phase.",
                "Explain the different phases of the UX development cycle, the methods and techniques of each phase (e.g.: ideation, affinity diagram, personas, wireframe development, mockup).",
                "Apply methods and techniques from each phase of the cycle in a proposed user interface development project, based on 'real' needs.",
                "Explain the fundamental concepts of Material Design (its relation to ergonomic criteria, its difference with flat design or pure flat design).",
                "Explain the basic concepts of the FLUX interface design pattern (its relationship to other MVC variants and other design patterns).",
                "Realize a user interface prototype with the REACT library (based on FLUX) and a CSS library applying the 'Material Design'.",
                "Select the appropriate type of interface assessment according to the project development phase and context.",
                "Conduct analytical and/or empirical assessments at each iteration and stage of the development cycle."
            ],
            "intro": "At the end of the course, the student knows"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-ITA2-I&courseId=B3C-TAP1-I",
        "module": "Informatique avancée 2",
        "course": "Programmation logique",
        "grade": 5.4,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours l'étudiant sait:",
            "list": [
                "Programmer avec un langage non-impératif; en l'occurrence le cours vise à faire découvrir le modèle de programmation logique, ainsi que la programmation par contraintes."
            ]
        },
        "contents": [
            {
                "intro": "Programmation logique (64 périodes):",
                "list": [
                    "Bases de Prolog : logique, prédicats, variable logique, arbre de dérivation.",
                    "Structures de données incomplètes.",
                    "Parcours de graphes d'états.",
                    "Problèmes du ''cut'', négation. Règles dynamiques (assert).",
                    "Definite Clause Grammars, utilisation de Prolog pour l'analyse syntaxique.",
                    "Meta-programmation. Notion de tableau noir.",
                    "Extension du modèle logique par l'expression de contraintes.",
                    "Propagation/distribution, techniques de programmation par contraintes, moteur GnuProlog",
                    "Programmation multi-langages"
                ]
            }
        ],
        "credits": 3,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Frédéric Bapst"
        ],
        "id": 49,
        "moduleEn": "Advanced Computer Science 2",
        "courseEn": "Logic Programming",
        "contentsEn": [
            {
                "list": [
                    "Basics of Prolog: logic, predicates, logic variable, bypass tree.",
                    "Incomplete data structures.",
                    "Browse through report networks.",
                    "Cutaneous problems, negative. Dynamic rules (assert).",
                    "Definite Clause Grammars, use of Prolog for syntax analysis.",
                    "Meta-programming. Notion of blackboard.",
                    "Extension of the logic model by the expression of constraints.",
                    "Propagation/distribution, constraint programming techniques, GnuProlog engine",
                    "Programmation multi-langages"
                ],
                "intro": "Logic programming (64 periods):"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Programming with a non-imperative language; in this case, the course aims to introduce the logic programming model, as well as constraint programming."
            ],
            "intro": "At the end of the course the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-PROS-I&courseId=B3C-PRI5-I",
        "module": "Projets de semestre",
        "course": "Semesterprojekt 5",
        "grade": 4.8,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Transposer dans la pratique et synthétiser les concepts théoriques appris dans différents cours.",
                "Travailler de manière autonome.",
                "Défendre les options scientifiques et techniques d'un projet devant un jury.",
                "Planifier un projet de taille moyenne.",
                "Elaborer et discuter un cahier des charges avec un client.",
                "Communiquer efficacement avec le chef de projet sur l'avancement du travail.",
                "Rédiger un rapport de projet.",
                "Présenter oralement un projet."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Projets individuels ou à deux généralement proposés par un partenaire externe (industrie, entreprise de services, institut universitaire)."
                ]
            },
            {
                "intro": "Pré-requis: tous les modules de 2ème année réussis",
                "list": []
            }
        ],
        "credits": 4,
        "year": 3,
        "semester": "Automne",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Daniel Gachet",
            "Rudolf Scheurer"
        ],
        "id": 50,
        "moduleEn": "Semester Projects",
        "courseEn": "Semester Project 5",
        "contentsEn": [
            {
                "list": [
                    "Individual or pair projects usually proposed by an external partner (industry, service company, academic institute)."
                ]
            },
            {
                "list": [],
                "intro": "Pre-requisite: all successful 2nd year modules"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "German",
        "evaluationsEn": [
            "Ongoing monitoring: TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Transpose into practice and synthesize the theoretical concepts learned in different courses.",
                "Work independently.",
                "Defend the scientific and technical options of a project before a jury.",
                "Planning a medium-sized project.",
                "Elaborate and discuss specifications with a client.",
                "Communicate effectively with the project leader on the progress of the work.",
                "Write a project report.",
                "Present a project orally."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-PROS-I&courseId=B3C-PRO5-IT",
        "module": "Projets de semestre",
        "course": "Semesterprojekt 6",
        "grade": 5.3,
        "periods": 60,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Transposer dans la pratique et synthétiser les concepts théoriques appris dans différents cours.",
                "Travailler de manière autonome.",
                "Défendre les options scientifiques et techniques d'un projet devant un jury.",
                "Planifier un projet de taille moyenne.",
                "Elaborer et discuter un cahier des charges avec un client.",
                "Communiquer efficacement avec le chef de projet sur l'avancement du travail.",
                "Rédiger un rapport de projet.",
                "Présenter oralement un projet."
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Projets individuels ou à deux qui durent deux blocs, généralement proposés par un partenaire externe (industrie, entreprise de services, institut universitaire)."
                ]
            },
            {
                "intro": "Pré-requis: tous les modules de 2ème année réussis",
                "list": []
            }
        ],
        "credits": 5,
        "year": 3,
        "semester": "Printemps",
        "language": "Allemand",
        "evaluations": [
            "Contrôle continu: TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Omar Abou Khaled",
            "Elena Mugellini"
        ],
        "id": 51,
        "moduleEn": "Semester Projects",
        "courseEn": "Semester Project 6",
        "contentsEn": [
            {
                "list": [
                    "Individual or two projects that last two blocks, usually proposed by an external partner (industry, service company, academic institute)."
                ]
            },
            {
                "list": [],
                "intro": "Pre-requisite: all successful 2nd year modules"
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "German",
        "evaluationsEn": [
            "Ongoing monitoring: TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Transpose into practice and synthesize the theoretical concepts learned in different courses.",
                "Work independently.",
                "Defend the scientific and technical options of a project before a jury.",
                "Planning a medium-sized project.",
                "Elaborate and discuss specifications with a client.",
                "Communicate effectively with the project leader on the progress of the work.",
                "Write a project report.",
                "Present a project orally."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-SIAM-I&courseId=B3C-TAP2-I",
        "module": "Spécialisation SI ou AM",
        "course": "Programmation avancée Java",
        "grade": 5,
        "periods": 32,
        "objectives": {
            "intro": "A la fin du cours l'étudiant sait:",
            "list": [
                "Développer une application Java communiquant à travers le réseau informatique",
                "Mettre en oeuvre des techniques permettant la création d'applications distribuées/réparties.",
                "Interfacer une application Java avec des composants logiciels écrits en C/C++."
            ]
        },
        "contents": [
            {
                "intro": "Programmation avancée en Java:",
                "list": [
                    "Mécanismes de base de la communication réseau en Java: Sockets",
                    "Interfaçage vers des composants logiciels natifs: JNI (Java Native Interface)",
                    "Couche d'abstraction pour l'invocation de méthodes à distance: RMI (Remote Method Incovation)",
                    "Gestion d'application à distance avec JMX (Java Management eXtension)"
                ]
            }
        ],
        "credits": 2,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports"
        ],
        "teachers": [
            "Rudolf Scheurer"
        ],
        "id": 52,
        "moduleEn": "Information Systems Specialization",
        "courseEn": "Advanced Java Programming",
        "contentsEn": [
            {
                "list": [
                    "Basic mechanisms of network communication in Java: Sockets",
                    "Interfacing to native software components: JNI (Java Native Interface)",
                    "Abstraction layer for remote method invocation: RMI (Remote Method Incovation)",
                    "Remote application management with JMX (Java Management eXtension)"
                ],
                "intro": "Advanced programming in Java:"
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports"
        ],
        "objectivesEn": {
            "list": [
                "Develop a Java application communicating through the computer network",
                "Implement techniques for creating distributed/distributed applications.",
                "Interfacing a Java application with software components written in C/C++."
            ],
            "intro": "At the end of the course the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-SIAM-I&courseId=B3C-SINF-I",
        "module": "Spécialisation SI ou AM",
        "course": "Systèmes d'information 2",
        "grade": 5.8,
        "periods": 64,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Installer, configurer et entretenir un serveur d'information.",
                "Analyser un besoin concret de système d'information et en concevoir l'architecture sur la base de modèles existants (N-tiers, réparti, etc.).",
                "Décrire, comparer et utiliser les technologies usuelles de présentation de l'information sur des supports fixes et mobiles.",
                "Appliquer et choisir les frameworks les plus pertinentes pour la réalisation d'un portail d'information.",
                "Concevoir une base de données XML et y accéder avec un langage d'interrogation approprié.",
                "Assumer une fonction de consultant technique auprès d'un client, dans le domaine des systèmes d'information.",
                "Déterminer les enjeux des nouvelles technologies, l'importance de la standardisation dans le processus d'échanges des données et dans la chaîne éditorial de l'entreprise"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Système d'information (Définition, principes, modèles, installation et configuration, protocoles d'accès, comparaison, etc.).",
                    "Protocoles et langages: HTTP, MIMETYPE, URI, XHTML, CSS.",
                    "Techniques avancées de modélisation de XML schéma.",
                    "Architectures client/serveur: 2 tiers, 3tiers, n-tiers et architectures SOA (Services Oriented Architecture).",
                    "Frameworks, serveurs d'applications et plateformes de developpement.",
                    "La plateforme .NET: introduction et principe de fonctionnement.",
                    "Plateforme .NET: ASP.NET et ADO.NET.",
                    "La platefrome Java EE: introduction et principes de fonctionnement.",
                    "Java EE: servlets, JSP et JSF.",
                    "Tour d'horizon des plateformes PhP et Ruby on Rails.",
                    "Les Web Services: principes et protocoles (UDDI, WSDL, SOAP).",
                    "Les bases de données XML.",
                    "Les RIA (Rich Internet Application) - AJAX - interfaces déclaratives (XAML, XUL, etc.).",
                    "Les annuaires et méta-annuaires."
                ]
            }
        ],
        "credits": 3,
        "year": 3,
        "semester": "Automne",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, travaux oraux"
        ],
        "teachers": [
            "Omar Abou Khaled",
            "Elena Mugellini"
        ],
        "id": 53,
        "moduleEn": "Information Systems Specialization",
        "courseEn": "Information Systems 2",
        "contentsEn": [
            {
                "list": [
                    "Information system (Definition, principles, models, installation and configuration, access protocols, comparison, etc.).",
                    "Protocols and languages: HTTP, MIMETYPE, URI, XHTML, CSS.",
                    "Advanced XML schema modeling techniques.",
                    "Client/server architectures: 2-tier, 3-tier, n-tier and SOA (Services Oriented Architecture) architectures.",
                    "Frameworks, application servers and development platforms.",
                    "The .NET platform: introduction and operating principle.",
                    "NET platform: ASP.NET and ADO.NET.",
                    "The Java EE platform: introduction and operating principles.",
                    "Java EE: servlets, JSP and JSF.",
                    "Overview of the PhP and Ruby on Rails platforms.",
                    "Web Services: principles and protocols (UDDI, WSDL, SOAP).",
                    "XML databases.",
                    "RIA (Rich Internet Application) - AJAX - declarative interfaces (XAML, XUL, etc.).",
                    "Directories and meta-directories."
                ]
            }
        ],
        "semesterEn": "Autumn",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, oral work"
        ],
        "objectivesEn": {
            "list": [
                "Install, configure and maintain an information server.",
                "Analyse a concrete need for an information system and design the architecture based on existing models (N-tier, distributed, etc.).",
                "Describe, compare and use common technologies for presenting information on fixed and mobile media.",
                "Apply and choose the most relevant frameworks for the realization of an information portal.",
                "Design an XML database and access it with an appropriate query language.",
                "Assume a technical consultancy function for a client in the field of information systems.",
                "Determine the stakes of new technologies, the importance of standardization in the process of data exchange and in the editorial chain of the company."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-SIAM-I&courseId=B3C-ARSI-I",
        "module": "Spécialisation SI ou AM",
        "course": "Architecture des systèmes d'information",
        "grade": 5.2,
        "periods": 128,
        "objectives": {
            "intro": "A la fin du cours, l'étudiant sait:",
            "list": [
                "Suivre une méthodologie pour concevoir, modéliser et implémenter un système d'information avec une architecture n-tiers.",
                "Etablir un comparatif justifié des technologiques utilisées pour réaliser un système d'information.",
                "Documenter clairement la partie technique, la partie installation et le manuel d'utilisation d'un produit."
            ]
        },
        "contents": [
            {
                "intro": "Il s'agit d'un projet intégré (PI) réalisé en groupe afin d'aquérir les compétences de gestion de projet de SI et d'entraîner les compétences techniques suivantes:",
                "list": []
            },
            {
                "intro": null,
                "list": [
                    "Mettre en application la théorie introduite dans génie logiciel 1 et 2.",
                    "Mettre en application la théorie introduite dans systèmes d'information 1 et 2.",
                    "Installation et utilisation d'un framework de développement (Java EE, .NET, etc.)",
                    "Installation, configuration et utilisation d'un environnement de développement intégré (VS 2008, Eclipse, etc.).",
                    "Mettre en application la théorie introduite dans base de données 1 et 2.",
                    "Attaquer un SGBD à travers un applicatif via JDBC ou ADO.",
                    "Etablir l'implémentation physique d'une base de données en justifiant les optimisations choisies.",
                    "Gérer du XML dans une base de données.",
                    "Utilisation d'outils de gestion de: journalisation, de tests, de modélistion, licences, de déploiement et de documentation de code."
                ]
            }
        ],
        "credits": 7,
        "year": 3,
        "semester": "Printemps",
        "language": "Français",
        "evaluations": [
            "Contrôle continu: travaux écrits, TP/évaluation de rapports, présentations"
        ],
        "teachers": [
            "Omar Abou Khaled",
            "Houda Chabbi",
            "Pierre Kuonen"
        ],
        "id": 54,
        "moduleEn": "Information Systems Specialization",
        "courseEn": "Information Systems Architecture",
        "contentsEn": [
            {
                "list": [],
                "intro": "This is an Integrated Project (IP) carried out as a group to acquire IS project management skills and to train the following technical skills:"
            },
            {
                "list": [
                    "Apply the theory introduced in Software Engineering 1 and 2.",
                    "Apply the theory introduced in Information Systems 1 and 2.",
                    "Installation and use of a development framework (Java EE, .NET, etc.)",
                    "Installation, configuration and use of an integrated development environment (VS 2008, Eclipse, etc.).",
                    "Apply the theory introduced in database 1 and 2.",
                    "Attack a DBMS through an application via JDBC or ADO.",
                    "Establish the physical implementation of a database by justifying the chosen optimizations.",
                    "Managing XML in a database.",
                    "Use of management tools for: logging, testing, modeling, licensing, deployment and code documentation."
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "French",
        "evaluationsEn": [
            "Continuous assessment: written work, TP/evaluation of reports, presentations"
        ],
        "objectivesEn": {
            "list": [
                "Follow a methodology to design, model and implement an information system with n-tier architecture.",
                "Establish a justified comparison of the technologies used to create an information system.",
                "Clearly document the technical part, the installation part and the user manual of a product."
            ],
            "intro": "At the end of the course, the student knows:"
        }
    },
    {
        "url": "https://www.heia-fr.ch/fr/formation/bachelor/informatique-et-systemes-de-communication/programme-de-formation//?cursus=bilingue&programId=INFO&optionId=&moduleId=B3M-TRBA-I&courseId=B3C-TBAC-IT",
        "module": "Travail de bachelor",
        "course": "Travail de Bachelor",
        "grade": 4.9,
        "periods": 0,
        "objectives": {
            "intro": "Développer les compétences suivantes: - compétences personnelles - compétences métiers - compétences méthodologiques",
            "list": [
                "Transposer dans la pratique et synthétiser les concepts théoriques appris dans différents modules.",
                "Travailler de manière autonome.",
                "Défendre les options scientifiques et techniques d'un projet devant un jury.",
                "Planifier un projet de taille moyenne.",
                "Elaborer et discuter un cahier des charges avec un client.",
                "Communiquer efficacement avec le chef de projet sur l'avancement du travail.",
                "Communiquer d'une manière précise et complète les résultats obtenus dans un rapport de projet ainsi que lors d'une défense devant un collège d'experts"
            ]
        },
        "contents": [
            {
                "intro": null,
                "list": [
                    "Projets individuels relatifs aux métiers TIC validés par le collège des experts. Ces projets sont généralement proposés par un partenaire externe (industrie, entreprise de services, institut universitaire) ."
                ]
            }
        ],
        "credits": 12,
        "year": 3,
        "semester": "Printemps",
        "language": "Anglais",
        "evaluations": [
            "Contrôle continu: Note définie sur : développement et réalisation, documentation, exposé"
        ],
        "teachers": [
            "Sandy Ingram",
            "Houda Chabbi"
        ],
        "id": 55,
        "moduleEn": "Bachelor Thesis",
        "courseEn": "Bachelor Thesis",
        "contentsEn": [
            {
                "list": [
                    "Individual projects relating to ICT professions validated by the college of experts. These projects are usually proposed by an external partner (industry, service company, university institute)."
                ]
            }
        ],
        "semesterEn": "Spring",
        "languageEn": "English",
        "evaluationsEn": [
            "Continuous monitoring: Defined note on: development and implementation, documentation, presentation, etc."
        ],
        "objectivesEn": {
            "list": [
                "Transpose into practice and synthesize the theoretical concepts learned in different modules.",
                "Work independently.",
                "Defend the scientific and technical options of a project before a jury.",
                "Planning a medium-sized project.",
                "Elaborate and discuss specifications with a client.",
                "Communicate effectively with the project leader on the progress of the work.",
                "Accurately and comprehensively communicate the results obtained in a project report and in a defence before a panel of experts."
            ],
            "intro": "Develop the following skills: - personal skills - business skills - methodological skills"
        }
    }
]